SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/**
 * @brief PORT
 */
typedef struct
{
    union
    {
        __IO uint8_t PIDR0;
        stc_port_pidr0_field_t PIDR0_f;
    };
    union
    {
        __IO uint8_t PIDR1;
        stc_port_pidr1_field_t PIDR1_f;
    };
    union
    {
        __IO uint8_t PIDR2;
        stc_port_pidr2_field_t PIDR2_f;
    };
    union
    {
        __IO uint8_t PIDR3;
        stc_port_pidr3_field_t PIDR3_f;
    };
    union
    {
        __IO uint8_t PIDR4;
        stc_port_pidr4_field_t PIDR4_f;
    };
    union
    {
        __IO uint8_t PIDR5;
        stc_port_pidr5_field_t PIDR5_f;
    };
    union
    {
        __IO uint8_t PIDR6;
        stc_port_pidr6_field_t PIDR6_f;
    };
    union
    {
        __IO uint8_t PIDR7;
        stc_port_pidr7_field_t PIDR7_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint8_t PIDR12;
        stc_port_pidr12_field_t PIDR12_f;
    };
    union
    {
        __IO uint8_t PIDR13;
        stc_port_pidr13_field_t PIDR13_f;
    };
    union
    {
        __IO uint8_t PIDR14;
        stc_port_pidr14_field_t PIDR14_f;
    };
    uint8_t RESERVED1[1];
    union
    {
        __IO uint8_t PODR0;
        stc_port_podr0_field_t PODR0_f;
    };
    union
    {
        __IO uint8_t PODR1;
        stc_port_podr1_field_t PODR1_f;
    };
    union
    {
        __IO uint8_t PODR2;
        stc_port_podr2_field_t PODR2_f;
    };
    union
    {
        __IO uint8_t PODR3;
        stc_port_podr3_field_t PODR3_f;
    };
    union
    {
        __IO uint8_t PODR4;
        stc_port_podr4_field_t PODR4_f;
    };
    union
    {
        __IO uint8_t PODR5;
        stc_port_podr5_field_t PODR5_f;
    };
    union
    {
        __IO uint8_t PODR6;
        stc_port_podr6_field_t PODR6_f;
    };
    union
    {
        __IO uint8_t PODR7;
        stc_port_podr7_field_t PODR7_f;
    };
    uint8_t RESERVED2[4];
    union
    {
        __IO uint8_t PODR12;
        stc_port_podr12_field_t PODR12_f;
    };
    union
    {
        __IO uint8_t PODR13;
        stc_port_podr13_field_t PODR13_f;
    };
    union
    {
        __IO uint8_t PODR14;
        stc_port_podr14_field_t PODR14_f;
    };
    uint8_t RESERVED3[1];
    union
    {
        __IO uint8_t POER0;
        stc_port_poer0_field_t POER0_f;
    };
    union
    {
        __IO uint8_t POER1;
        stc_port_poer1_field_t POER1_f;
    };
    union
    {
        __IO uint8_t POER2;
        stc_port_poer2_field_t POER2_f;
    };
    union
    {
        __IO uint8_t POER3;
        stc_port_poer3_field_t POER3_f;
    };
    union
    {
        __IO uint8_t POER4;
        stc_port_poer4_field_t POER4_f;
    };
    union
    {
        __IO uint8_t POER5;
        stc_port_poer5_field_t POER5_f;
    };
    union
    {
        __IO uint8_t POER6;
        stc_port_poer6_field_t POER6_f;
    };
    union
    {
        __IO uint8_t POER7;
        stc_port_poer7_field_t POER7_f;
    };
    uint8_t RESERVED4[4];
    union
    {
        __IO uint8_t POER12;
        stc_port_poer12_field_t POER12_f;
    };
    union
    {
        __IO uint8_t POER13;
        stc_port_poer13_field_t POER13_f;
    };
    union
    {
        __IO uint8_t POER14;
        stc_port_poer14_field_t POER14_f;
    };
    uint8_t RESERVED5[1];
    union
    {
        __IO uint8_t POSR0;
        stc_port_posr0_field_t POSR0_f;
    };
    union
    {
        __IO uint8_t POSR1;
        stc_port_posr1_field_t POSR1_f;
    };
    union
    {
        __IO uint8_t POSR2;
        stc_port_posr2_field_t POSR2_f;
    };
    union
    {
        __IO uint8_t POSR3;
        stc_port_posr3_field_t POSR3_f;
    };
    union
    {
        __IO uint8_t POSR4;
        stc_port_posr4_field_t POSR4_f;
    };
    union
    {
        __IO uint8_t POSR5;
        stc_port_posr5_field_t POSR5_f;
    };
    union
    {
        __IO uint8_t POSR6;
        stc_port_posr6_field_t POSR6_f;
    };
    union
    {
        __IO uint8_t POSR7;
        stc_port_posr7_field_t POSR7_f;
    };
    uint8_t RESERVED6[4];
    union
    {
        __IO uint8_t POSR12;
        stc_port_posr12_field_t POSR12_f;
    };
    union
    {
        __IO uint8_t POSR13;
        stc_port_posr13_field_t POSR13_f;
    };
    union
    {
        __IO uint8_t POSR14;
        stc_port_posr14_field_t POSR14_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint8_t PORR0;
        stc_port_porr0_field_t PORR0_f;
    };
    union
    {
        __IO uint8_t PORR1;
        stc_port_porr1_field_t PORR1_f;
    };
    union
    {
        __IO uint8_t PORR2;
        stc_port_porr2_field_t PORR2_f;
    };
    union
    {
        __IO uint8_t PORR3;
        stc_port_porr3_field_t PORR3_f;
    };
    union
    {
        __IO uint8_t PORR4;
        stc_port_porr4_field_t PORR4_f;
    };
    union
    {
        __IO uint8_t PORR5;
        stc_port_porr5_field_t PORR5_f;
    };
    union
    {
        __IO uint8_t PORR6;
        stc_port_porr6_field_t PORR6_f;
    };
    union
    {
        __IO uint8_t PORR7;
        stc_port_porr7_field_t PORR7_f;
    };
    uint8_t RESERVED8[4];
    union
    {
        __IO uint8_t PORR12;
        stc_port_porr12_field_t PORR12_f;
    };
    union
    {
        __IO uint8_t PORR13;
        stc_port_porr13_field_t PORR13_f;
    };
    union
    {
        __IO uint8_t PORR14;
        stc_port_porr14_field_t PORR14_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint8_t POTR0;
        stc_port_potr0_field_t POTR0_f;
    };
    union
    {
        __IO uint8_t POTR1;
        stc_port_potr1_field_t POTR1_f;
    };
    union
    {
        __IO uint8_t POTR2;
        stc_port_potr2_field_t POTR2_f;
    };
    union
    {
        __IO uint8_t POTR3;
        stc_port_potr3_field_t POTR3_f;
    };
    union
    {
        __IO uint8_t POTR4;
        stc_port_potr4_field_t POTR4_f;
    };
    union
    {
        __IO uint8_t POTR5;
        stc_port_potr5_field_t POTR5_f;
    };
    union
    {
        __IO uint8_t POTR6;
        stc_port_potr6_field_t POTR6_f;
    };
    union
    {
        __IO uint8_t POTR7;
        stc_port_potr7_field_t POTR7_f;
    };
    uint8_t RESERVED10[4];
    union
    {
        __IO uint8_t POTR12;
        stc_port_potr12_field_t POTR12_f;
    };
    union
    {
        __IO uint8_t POTR13;
        stc_port_potr13_field_t POTR13_f;
    };
    union
    {
        __IO uint8_t POTR14;
        stc_port_potr14_field_t POTR14_f;
    };
    uint8_t RESERVED11[929];
    union
    {
        __IO uint16_t PCR00;
        stc_port_pcr_field_t PCR00_f;
    };
    union
    {
        __IO uint16_t PCR01;
        stc_port_pcr_field_t PCR01_f;
    };
    uint8_t RESERVED12[12];
    union
    {
        __IO uint16_t PCR10;
        stc_port_pcr_field_t PCR10_f;
    };
    union
    {
        __IO uint16_t PCR11;
        stc_port_pcr_field_t PCR11_f;
    };
    union
    {
        __IO uint16_t PCR12;
        stc_port_pcr_field_t PCR12_f;
    };
    union
    {
        __IO uint16_t PCR13;
        stc_port_pcr_field_t PCR13_f;
    };
    union
    {
        __IO uint16_t PCR14;
        stc_port_pcr_field_t PCR14_f;
    };
    union
    {
        __IO uint16_t PCR15;
        stc_port_pcr_field_t PCR15_f;
    };
    union
    {
        __IO uint16_t PCR16;
        stc_port_pcr_field_t PCR16_f;
    };
    union
    {
        __IO uint16_t PCR17;
        stc_port_pcr_field_t PCR17_f;
    };
    union
    {
        __IO uint16_t PCR20;
        stc_port_pcr_field_t PCR20_f;
    };
    union
    {
        __IO uint16_t PCR21;
        stc_port_pcr_field_t PCR21_f;
    };
    union
    {
        __IO uint16_t PCR22;
        stc_port_pcr_field_t PCR22_f;
    };
    union
    {
        __IO uint16_t PCR23;
        stc_port_pcr_field_t PCR23_f;
    };
    union
    {
        __IO uint16_t PCR24;
        stc_port_pcr_field_t PCR24_f;
    };
    union
    {
        __IO uint16_t PCR25;
        stc_port_pcr_field_t PCR25_f;
    };
    union
    {
        __IO uint16_t PCR26;
        stc_port_pcr_field_t PCR26_f;
    };
    union
    {
        __IO uint16_t PCR27;
        stc_port_pcr_field_t PCR27_f;
    };
    union
    {
        __IO uint16_t PCR30;
        stc_port_pcr_field_t PCR30_f;
    };
    union
    {
        __IO uint16_t PCR31;
        stc_port_pcr_field_t PCR31_f;
    };
    uint8_t RESERVED13[12];
    union
    {
        __IO uint16_t PCR40;
        stc_port_pcr_field_t PCR40_f;
    };
    union
    {
        __IO uint16_t PCR41;
        stc_port_pcr_field_t PCR41_f;
    };
    uint8_t RESERVED14[12];
    union
    {
        __IO uint16_t PCR50;
        stc_port_pcr_field_t PCR50_f;
    };
    union
    {
        __IO uint16_t PCR51;
        stc_port_pcr_field_t PCR51_f;
    };
    uint8_t RESERVED15[12];
    union
    {
        __IO uint16_t PCR60;
        stc_port_pcr_field_t PCR60_f;
    };
    union
    {
        __IO uint16_t PCR61;
        stc_port_pcr_field_t PCR61_f;
    };
    union
    {
        __IO uint16_t PCR62;
        stc_port_pcr_field_t PCR62_f;
    };
    union
    {
        __IO uint16_t PCR63;
        stc_port_pcr_field_t PCR63_f;
    };
    uint8_t RESERVED16[8];
    union
    {
        __IO uint16_t PCR70;
        stc_port_pcr_field_t PCR70_f;
    };
    union
    {
        __IO uint16_t PCR71;
        stc_port_pcr_field_t PCR71_f;
    };
    union
    {
        __IO uint16_t PCR72;
        stc_port_pcr_field_t PCR72_f;
    };
    union
    {
        __IO uint16_t PCR73;
        stc_port_pcr_field_t PCR73_f;
    };
    union
    {
        __IO uint16_t PCR74;
        stc_port_pcr_field_t PCR74_f;
    };
    union
    {
        __IO uint16_t PCR75;
        stc_port_pcr_field_t PCR75_f;
    };
    uint8_t RESERVED17[68];
    union
    {
        __IO uint16_t PCR120;
        stc_port_pcr_field_t PCR120_f;
    };
    union
    {
        __IO uint16_t PCR121;
        stc_port_pcr_field_t PCR121_f;
    };
    union
    {
        __IO uint16_t PCR122;
        stc_port_pcr_field_t PCR122_f;
    };
    union
    {
        __IO uint16_t PCR123;
        stc_port_pcr_field_t PCR123_f;
    };
    union
    {
        __IO uint16_t PCR124;
        stc_port_pcr_field_t PCR124_f;
    };
    uint8_t RESERVED18[6];
    union
    {
        __IO uint16_t PCR130;
        stc_port_pcr_field_t PCR130_f;
    };
    uint8_t RESERVED19[12];
    union
    {
        __IO uint16_t PCR137;
        stc_port_pcr_field_t PCR137_f;
    };
    union
    {
        __IO uint16_t PCR140;
        stc_port_pcr_field_t PCR140_f;
    };
    uint8_t RESERVED20[10];
    union
    {
        __IO uint16_t PCR146;
        stc_port_pcr_field_t PCR146_f;
    };
    union
    {
        __IO uint16_t PCR147;
        stc_port_pcr_field_t PCR147_f;
    };
    uint8_t RESERVED21[16];
    union
    {
        __IO uint16_t PSPCR;
        stc_port_pspcr_field_t PSPCR_f;
    };
    uint8_t RESERVED22[2];
    union
    {
        __IO uint16_t PCCR;
        stc_port_pccr_field_t PCCR_f;
    };
    union
    {
        __IO uint16_t PINAER;
        stc_port_pinaer_field_t PINAER_f;
    };
    union
    {
        __IO uint16_t PWPR;
        stc_port_pwpr_field_t PWPR_f;
    };
} M0P_PORT_TypeDef;

/**
 * @brief PWC
 */
typedef struct
{
    union
    {
        __IO uint8_t STPMCR;
        stc_pwc_stpmcr_field_t STPMCR_f;
    };
    uint8_t RESERVED0[3];
    union
    {
        __IO uint8_t PWRC;
        stc_pwc_pwrc_field_t PWRC_f;
    };
    uint8_t RESERVED1[7];
    union
    {
        __IO uint8_t RAMCR;
        stc_pwc_ramcr_field_t RAMCR_f;
    };
    uint8_t RESERVED2[3];
    union
    {
        __IO uint8_t LVDCSR;
        stc_pwc_lvdcsr_field_t LVDCSR_f;
    };
    uint8_t RESERVED3[15];
    union
    {
        __IO uint16_t FPRC;
        stc_pwc_fprc_field_t FPRC_f;
    };
    uint8_t RESERVED4[30];
    union
    {
        __IO uint8_t DBGC;
        stc_pwc_dbgc_field_t DBGC_f;
    };
} M0P_PWC_TypeDef;

/**
 * @brief RMU
 */
typedef struct
{
    union
    {
        __IO uint16_t RSTF0;
        stc_rmu_rstf0_field_t RSTF0_f;
    };
} M0P_RMU_TypeDef;

/**
 * @brief SPI
 */
typedef struct
{
    union
    {
        __IO uint32_t DR;
        stc_spi_dr_field_t DR_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_spi_cr1_field_t CR1_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CFG1;
        stc_spi_cfg1_field_t CFG1_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t SR;
        stc_spi_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t CFG2;
        stc_spi_cfg2_field_t CFG2_f;
    };
} M0P_SPI_TypeDef;

/**
 * @brief SWDT
 */
typedef struct
{
    union
    {
        __IO uint32_t CR;
        stc_swdt_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t SR;
        stc_swdt_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t RR;
        stc_swdt_rr_field_t RR_f;
    };
} M0P_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct
{
    union
    {
        __IO uint32_t CNTAR;
        stc_tmr0_cntar_field_t CNTAR_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CMPAR;
        stc_tmr0_cmpar_field_t CMPAR_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t BCONR;
        stc_tmr0_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr0_stflr_field_t STFLR_f;
    };
} M0P_TMR0_TypeDef;

/**
 * @brief TMR2
 */
typedef struct
{
    union
    {
        __IO uint32_t CNTAR;
        stc_tmr2_cntar_field_t CNTAR_f;
    };
    uint8_t RESERVED0[4];
    union
    {
        __IO uint32_t CMPAR;
        stc_tmr2_cmpar_field_t CMPAR_f;
    };
    uint8_t RESERVED1[4];
    union
    {
        __IO uint32_t BCONR;
        stc_tmr2_bconr_field_t BCONR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmr2_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t PCONR;
        stc_tmr2_pconr_field_t PCONR_f;
    };
    union
    {
        __IO uint32_t HCONR;
        stc_tmr2_hconr_field_t HCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmr2_stflr_field_t STFLR_f;
    };
} M0P_TMR2_TypeDef;

/**
 * @brief TMR4
 */
typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    union
    {
        __IO uint16_t OCSRU;
        stc_tmr4_ocsr_field_t OCSRU_f;
    };
    union
    {
        __IO uint16_t OCERU;
        stc_tmr4_ocer_field_t OCERU_f;
    };
    union
    {
        __IO uint16_t OCSRV;
        stc_tmr4_ocsr_field_t OCSRV_f;
    };
    union
    {
        __IO uint16_t OCERV;
        stc_tmr4_ocer_field_t OCERV_f;
    };
    union
    {
        __IO uint16_t OCSRW;
        stc_tmr4_ocsr_field_t OCSRW_f;
    };
    union
    {
        __IO uint16_t OCERW;
        stc_tmr4_ocer_field_t OCERW_f;
    };
    union
    {
        __IO uint16_t OCMRHUH;
        stc_tmr4_ocmrh_field_t OCMRHUH_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint32_t OCMRLUL;
        stc_tmr4_ocmrl_field_t OCMRLUL_f;
    };
    union
    {
        __IO uint16_t OCMRHVH;
        stc_tmr4_ocmrh_field_t OCMRHVH_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint32_t OCMRLVL;
        stc_tmr4_ocmrl_field_t OCMRLVL_f;
    };
    union
    {
        __IO uint16_t OCMRHWH;
        stc_tmr4_ocmrh_field_t OCMRHWH_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint32_t OCMRLWL;
        stc_tmr4_ocmrl_field_t OCMRLWL_f;
    };
    uint8_t RESERVED9[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED10[2];
    __IO uint16_t CNTR;
    union
    {
        __IO uint16_t CCSR;
        stc_tmr4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CVPR;
        stc_tmr4_cvpr_field_t CVPR_f;
    };
    uint8_t RESERVED11[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED12[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED13[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    union
    {
        __IO uint16_t POCRU;
        stc_tmr4_pocr_field_t POCRU_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint16_t POCRV;
        stc_tmr4_pocr_field_t POCRV_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint16_t POCRW;
        stc_tmr4_pocr_field_t POCRW_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint16_t RCSR;
        stc_tmr4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED17[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED18[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED19[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED20[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRWL;
    union
    {
        __IO uint16_t SCSRUH;
        stc_tmr4_scsr_field_t SCSRUH_f;
    };
    union
    {
        __IO uint16_t SCMRUH;
        stc_tmr4_scmr_field_t SCMRUH_f;
    };
    union
    {
        __IO uint16_t SCSRUL;
        stc_tmr4_scsr_field_t SCSRUL_f;
    };
    union
    {
        __IO uint16_t SCMRUL;
        stc_tmr4_scmr_field_t SCMRUL_f;
    };
    union
    {
        __IO uint16_t SCSRVH;
        stc_tmr4_scsr_field_t SCSRVH_f;
    };
    union
    {
        __IO uint16_t SCMRVH;
        stc_tmr4_scmr_field_t SCMRVH_f;
    };
    union
    {
        __IO uint16_t SCSRVL;
        stc_tmr4_scsr_field_t SCSRVL_f;
    };
    union
    {
        __IO uint16_t SCMRVL;
        stc_tmr4_scmr_field_t SCMRVL_f;
    };
    union
    {
        __IO uint16_t SCSRWH;
        stc_tmr4_scsr_field_t SCSRWH_f;
    };
    union
    {
        __IO uint16_t SCMRWH;
        stc_tmr4_scmr_field_t SCMRWH_f;
    };
    union
    {
        __IO uint16_t SCSRWL;
        stc_tmr4_scsr_field_t SCSRWL_f;
    };
    union
    {
        __IO uint16_t SCMRWL;
        stc_tmr4_scmr_field_t SCMRWL_f;
    };
    uint8_t RESERVED23[824];
    union
    {
        __IO uint32_t ECSR;
        stc_tmr4_ecsr_field_t ECSR_f;
    };
} M0P_TMR4_TypeDef;

/**
 * @brief TMRA
 */
typedef struct
{
    union
    {
        __IO uint16_t CNTER;
        stc_tmra_cnter_field_t CNTER_f;
    };
    uint8_t RESERVED0[2];
    union
    {
        __IO uint16_t PERAR;
        stc_tmra_perar_field_t PERAR_f;
    };
    uint8_t RESERVED1[58];
    union
    {
        __IO uint16_t CMPAR1;
        stc_tmra_cmpar1_field_t CMPAR1_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint16_t CMPAR2;
        stc_tmra_cmpar2_field_t CMPAR2_f;
    };
    uint8_t RESERVED3[58];
    union
    {
        __IO uint16_t BCSTR;
        stc_tmra_bcstr_field_t BCSTR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t HCONR;
        stc_tmra_hconr_field_t HCONR_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t HCUPR;
        stc_tmra_hcupr_field_t HCUPR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t HCDOR;
        stc_tmra_hcdor_field_t HCDOR_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint16_t ICONR;
        stc_tmra_iconr_field_t ICONR_f;
    };
    uint8_t RESERVED8[2];
    union
    {
        __IO uint16_t ECONR;
        stc_tmra_econr_field_t ECONR_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t FCONR;
        stc_tmra_fconr_field_t FCONR_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t STFLR;
        stc_tmra_stflr_field_t STFLR_f;
    };
    uint8_t RESERVED11[34];
    union
    {
        __IO uint16_t BCONR;
        stc_tmra_bconr_field_t BCONR_f;
    };
    uint8_t RESERVED12[62];
    union
    {
        __IO uint16_t CCONR1;
        stc_tmra_cconr1_field_t CCONR1_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t CCONR2;
        stc_tmra_cconr2_field_t CCONR2_f;
    };
    uint8_t RESERVED14[58];
    union
    {
        __IO uint16_t PCONR1;
        stc_tmra_pconr1_field_t PCONR1_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint16_t PCONR2;
        stc_tmra_pconr2_field_t PCONR2_f;
    };
} M0P_TMRA_TypeDef;

/**
 * @brief TMRB
 */
typedef struct
{
    union
    {
        __IO uint16_t CNTER;
        stc_tmrb_cnter_field_t CNTER_f;
    };
    uint8_t RESERVED0[2];
    union
    {
        __IO uint16_t PERAR;
        stc_tmrb_perar_field_t PERAR_f;
    };
    uint8_t RESERVED1[58];
    union
    {
        __IO uint16_t CMPAR;
        stc_tmrb_cmpar_field_t CMPAR_f;
    };
    uint8_t RESERVED2[62];
    union
    {
        __IO uint16_t BCSTR;
        stc_tmrb_bcstr_field_t BCSTR_f;
    };
    uint8_t RESERVED3[2];
    union
    {
        __IO uint16_t HCONR;
        stc_tmrb_hconr_field_t HCONR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t HCUPR;
        stc_tmrb_hcupr_field_t HCUPR_f;
    };
    uint8_t RESERVED5[2];
    union
    {
        __IO uint16_t HCDOR;
        stc_tmrb_hcdor_field_t HCDOR_f;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t ICONR;
        stc_tmrb_iconr_field_t ICONR_f;
    };
    uint8_t RESERVED7[2];
    union
    {
        __IO uint32_t ECONR;
        stc_tmrb_econr_field_t ECONR_f;
    };
    uint8_t RESERVED8[4];
    union
    {
        __IO uint16_t STFLR;
        stc_tmrb_stflr_field_t STFLR_f;
    };
    uint8_t RESERVED9[98];
    union
    {
        __IO uint16_t CCONR;
        stc_tmrb_cconr_field_t CCONR_f;
    };
    uint8_t RESERVED10[62];
    union
    {
        __IO uint16_t PCONR;
        stc_tmrb_pconr_field_t PCONR_f;
    };
} M0P_TMRB_TypeDef;

/**
 * @brief USART
 */
typedef struct
{
    union
    {
        __IO uint32_t SR;
        stc_usart_sr_field_t SR_f;
    };
    union
    {
        __IO uint32_t DR;
        stc_usart_dr_field_t DR_f;
    };
    union
    {
        __IO uint32_t BRR;
        stc_usart_brr_field_t BRR_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_usart_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t CR2;
        stc_usart_cr2_field_t CR2_f;
    };
    union
    {
        __IO uint32_t CR3;
        stc_usart_cr3_field_t CR3_f;
    };
    union
    {
        __IO uint32_t PR;
        stc_usart_pr_field_t PR_f;
    };
} M0P_USART_TypeDef;



/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/

