SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_MDR register  */
#define CMP_MDR_CENB_POS                     (0U)
#define CMP_MDR_CENB                         ((uint8_t)0x01U)
#define CMP_MDR_CWDE_POS                     (1U)
#define CMP_MDR_CWDE                         ((uint8_t)0x02U)
#define CMP_MDR_CMON_POS                     (7U)
#define CMP_MDR_CMON                         ((uint8_t)0x80U)

/*  Bit definition for CMP_FIR register  */
#define CMP_FIR_FCKS_POS                     (0U)
#define CMP_FIR_FCKS                         ((uint8_t)0x03U)
#define CMP_FIR_FCKS_0                       ((uint8_t)0x01U)
#define CMP_FIR_FCKS_1                       ((uint8_t)0x02U)
#define CMP_FIR_EDGS_POS                     (4U)
#define CMP_FIR_EDGS                         ((uint8_t)0x30U)
#define CMP_FIR_EDGS_0                       ((uint8_t)0x10U)
#define CMP_FIR_EDGS_1                       ((uint8_t)0x20U)
#define CMP_FIR_CIEN_POS                     (6U)
#define CMP_FIR_CIEN                         ((uint8_t)0x40U)

/*  Bit definition for CMP_OCR register  */
#define CMP_OCR_COEN_POS                     (0U)
#define CMP_OCR_COEN                         ((uint8_t)0x01U)
#define CMP_OCR_COPS_POS                     (1U)
#define CMP_OCR_COPS                         ((uint8_t)0x02U)
#define CMP_OCR_CPOE_POS                     (2U)
#define CMP_OCR_CPOE                         ((uint8_t)0x04U)
#define CMP_OCR_TWOE_POS                     (3U)
#define CMP_OCR_TWOE                         ((uint8_t)0x08U)
#define CMP_OCR_TWOL_POS                     (4U)
#define CMP_OCR_TWOL                         ((uint8_t)0x10U)

/*  Bit definition for CMP_VSR register  */
#define CMP_VSR_RVSL_POS                     (0U)
#define CMP_VSR_RVSL                         ((uint8_t)0x07U)
#define CMP_VSR_RVSL_0                       ((uint8_t)0x01U)
#define CMP_VSR_RVSL_1                       ((uint8_t)0x02U)
#define CMP_VSR_RVSL_2                       ((uint8_t)0x04U)
#define CMP_VSR_CVSL_POS                     (4U)
#define CMP_VSR_CVSL                         ((uint8_t)0x70U)
#define CMP_VSR_CVSL_0                       ((uint8_t)0x10U)
#define CMP_VSR_CVSL_1                       ((uint8_t)0x20U)
#define CMP_VSR_CVSL_2                       ((uint8_t)0x40U)

/*  Bit definition for CMP_TWR1 register  */
#define CMP_TWR1_CTWS0_POS                   (0U)
#define CMP_TWR1_CTWS0                       ((uint8_t)0x01U)
#define CMP_TWR1_CTWS1_POS                   (1U)
#define CMP_TWR1_CTWS1                       ((uint8_t)0x02U)
#define CMP_TWR1_CTWS2_POS                   (2U)
#define CMP_TWR1_CTWS2                       ((uint8_t)0x04U)
#define CMP_TWR1_CTWS3_POS                   (3U)
#define CMP_TWR1_CTWS3                       ((uint8_t)0x08U)
#define CMP_TWR1_CTWS4_POS                   (4U)
#define CMP_TWR1_CTWS4                       ((uint8_t)0x10U)
#define CMP_TWR1_CTWS5_POS                   (5U)
#define CMP_TWR1_CTWS5                       ((uint8_t)0x20U)
#define CMP_TWR1_CTWS6_POS                   (6U)
#define CMP_TWR1_CTWS6                       ((uint8_t)0x40U)
#define CMP_TWR1_CTWS7_POS                   (7U)
#define CMP_TWR1_CTWS7                       ((uint8_t)0x80U)

/*  Bit definition for CMP_TWR2 register  */
#define CMP_TWR2_CTWP0_POS                   (0U)
#define CMP_TWR2_CTWP0                       ((uint8_t)0x01U)
#define CMP_TWR2_CTWP1_POS                   (1U)
#define CMP_TWR2_CTWP1                       ((uint8_t)0x02U)
#define CMP_TWR2_CTWP2_POS                   (2U)
#define CMP_TWR2_CTWP2                       ((uint8_t)0x04U)
#define CMP_TWR2_CTWP3_POS                   (3U)
#define CMP_TWR2_CTWP3                       ((uint8_t)0x08U)
#define CMP_TWR2_CTWP4_POS                   (4U)
#define CMP_TWR2_CTWP4                       ((uint8_t)0x10U)
#define CMP_TWR2_CTWP5_POS                   (5U)
#define CMP_TWR2_CTWP5                       ((uint8_t)0x20U)
#define CMP_TWR2_CTWP6_POS                   (6U)
#define CMP_TWR2_CTWP6                       ((uint8_t)0x40U)
#define CMP_TWR2_CTWP7_POS                   (7U)
#define CMP_TWR2_CTWP7                       ((uint8_t)0x80U)


/*******************************************************************************
                Bit definition for Peripheral CMU
*******************************************************************************/
/*  Bit definition for CMU_PERICKSEL register  */
#define CMU_PERICKSEL_PERICKSEL_POS          (0U)
#define CMU_PERICKSEL_PERICKSEL              ((uint8_t)0x07U)
#define CMU_PERICKSEL_PERICKSEL_0            ((uint8_t)0x01U)
#define CMU_PERICKSEL_PERICKSEL_1            ((uint8_t)0x02U)
#define CMU_PERICKSEL_PERICKSEL_2            ((uint8_t)0x04U)

/*  Bit definition for CMU_XTALSTDSR register  */
#define CMU_XTALSTDSR_XTALSTDF_POS           (0U)
#define CMU_XTALSTDSR_XTALSTDF               ((uint8_t)0x01U)

/*  Bit definition for CMU_SCKDIVR register  */
#define CMU_SCKDIVR_SCKDIV_POS               (0U)
#define CMU_SCKDIVR_SCKDIV                   ((uint8_t)0x07U)
#define CMU_SCKDIVR_SCKDIV_0                 ((uint8_t)0x01U)
#define CMU_SCKDIVR_SCKDIV_1                 ((uint8_t)0x02U)
#define CMU_SCKDIVR_SCKDIV_2                 ((uint8_t)0x04U)

/*  Bit definition for CMU_CKSWR register  */
#define CMU_CKSWR_CKSW_POS                   (0U)
#define CMU_CKSWR_CKSW                       ((uint8_t)0x03U)
#define CMU_CKSWR_CKSW_0                     ((uint8_t)0x01U)
#define CMU_CKSWR_CKSW_1                     ((uint8_t)0x02U)

/*  Bit definition for CMU_XTALCR register  */
#define CMU_XTALCR_XTALSTP_POS               (0U)
#define CMU_XTALCR_XTALSTP                   ((uint8_t)0x01U)

/*  Bit definition for CMU_XTALCFGR register  */
#define CMU_XTALCFGR_XTALDRV_POS             (4U)
#define CMU_XTALCFGR_XTALDRV                 ((uint8_t)0x30U)
#define CMU_XTALCFGR_XTALDRV_0               ((uint8_t)0x10U)
#define CMU_XTALCFGR_XTALDRV_1               ((uint8_t)0x20U)
#define CMU_XTALCFGR_XTALMS_POS              (6U)
#define CMU_XTALCFGR_XTALMS                  ((uint8_t)0x40U)
#define CMU_XTALCFGR_SUPDRV_POS              (7U)
#define CMU_XTALCFGR_SUPDRV                  ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTBCR register  */
#define CMU_XTALSTBCR_XTALSTB_POS            (0U)
#define CMU_XTALSTBCR_XTALSTB                ((uint8_t)0x07U)
#define CMU_XTALSTBCR_XTALSTB_0              ((uint8_t)0x01U)
#define CMU_XTALSTBCR_XTALSTB_1              ((uint8_t)0x02U)
#define CMU_XTALSTBCR_XTALSTB_2              ((uint8_t)0x04U)

