SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral DBGC
*******************************************************************************/
/*  Bit definition for DBGC_MCUDBGSTAT register  */
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ_POS     (0U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPREQ         ((uint32_t)0x00000001U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK_POS     (1U)
#define DBGC_MCUDBGSTAT_CDBGPWRUPACK         ((uint32_t)0x00000002U)

/*  Bit definition for DBGC_MCUSTPCTL register  */
#define DBGC_MCUSTPCTL_SWDTSTP_POS           (0U)
#define DBGC_MCUSTPCTL_SWDTSTP               ((uint32_t)0x00000001U)
#define DBGC_MCUSTPCTL_RTCSTP_POS            (2U)
#define DBGC_MCUSTPCTL_RTCSTP                ((uint32_t)0x00000004U)
#define DBGC_MCUSTPCTL_PVDSTP_POS            (3U)
#define DBGC_MCUSTPCTL_PVDSTP                ((uint32_t)0x00000008U)
#define DBGC_MCUSTPCTL_TMR01STP_POS          (14U)
#define DBGC_MCUSTPCTL_TMR01STP              ((uint32_t)0x00004000U)
#define DBGC_MCUSTPCTL_TMR21STP_POS          (17U)
#define DBGC_MCUSTPCTL_TMR21STP              ((uint32_t)0x00020000U)
#define DBGC_MCUSTPCTL_TMR41STP_POS          (20U)
#define DBGC_MCUSTPCTL_TMR41STP              ((uint32_t)0x00100000U)
#define DBGC_MCUSTPCTL_TMRA1STP_POS          (23U)
#define DBGC_MCUSTPCTL_TMRA1STP              ((uint32_t)0x00800000U)
#define DBGC_MCUSTPCTL_TMRB1STP_POS          (24U)
#define DBGC_MCUSTPCTL_TMRB1STP              ((uint32_t)0x01000000U)
#define DBGC_MCUSTPCTL_TMRB2STP_POS          (25U)
#define DBGC_MCUSTPCTL_TMRB2STP              ((uint32_t)0x02000000U)
#define DBGC_MCUSTPCTL_TMRB3STP_POS          (26U)
#define DBGC_MCUSTPCTL_TMRB3STP              ((uint32_t)0x04000000U)
#define DBGC_MCUSTPCTL_TMRB4STP_POS          (27U)
#define DBGC_MCUSTPCTL_TMRB4STP              ((uint32_t)0x08000000U)
#define DBGC_MCUSTPCTL_TMRB5STP_POS          (28U)
#define DBGC_MCUSTPCTL_TMRB5STP              ((uint32_t)0x10000000U)
#define DBGC_MCUSTPCTL_TMRB6STP_POS          (29U)
#define DBGC_MCUSTPCTL_TMRB6STP              ((uint32_t)0x20000000U)
#define DBGC_MCUSTPCTL_TMRB7STP_POS          (30U)
#define DBGC_MCUSTPCTL_TMRB7STP              ((uint32_t)0x40000000U)
#define DBGC_MCUSTPCTL_TMRB8STP_POS          (31U)
#define DBGC_MCUSTPCTL_TMRB8STP              ((uint32_t)0x80000000U)


/*******************************************************************************
                Bit definition for Peripheral DBGC_T
*******************************************************************************/
/*  Bit definition for DBGC_T_AUTHID0 register  */
#define DBGC_T_AUTHID0_AUTHID0               ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBGC_T_AUTHID1 register  */
#define DBGC_T_AUTHID1_AUTHID1               ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBGC_T_AUTHID2 register  */
#define DBGC_T_AUTHID2_AUTHID2               ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBGC_T_RESV0 register  */
#define DBGC_T_RESV0_RESV0                   ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBGC_T_MCUSTAT register  */
#define DBGC_T_MCUSTAT_AUTH_POS              (0U)
#define DBGC_T_MCUSTAT_AUTH                  ((uint32_t)0x00000001U)
#define DBGC_T_MCUSTAT_REMVLOCK_POS          (1U)
#define DBGC_T_MCUSTAT_REMVLOCK              ((uint32_t)0x00000002U)
#define DBGC_T_MCUSTAT_SAFTYLOCK1_POS        (2U)
#define DBGC_T_MCUSTAT_SAFTYLOCK1            ((uint32_t)0x00000004U)
#define DBGC_T_MCUSTAT_SAFTYLOCK2_POS        (3U)
#define DBGC_T_MCUSTAT_SAFTYLOCK2            ((uint32_t)0x00000008U)
#define DBGC_T_MCUSTAT_MCUSTAT0_POS          (8U)
#define DBGC_T_MCUSTAT_MCUSTAT0              ((uint32_t)0x00000100U)
#define DBGC_T_MCUSTAT_MCUSTAT1_POS          (9U)
#define DBGC_T_MCUSTAT_MCUSTAT1              ((uint32_t)0x00000200U)

/*  Bit definition for DBGC_T_MCUCTL register  */
#define DBGC_T_MCUCTL_EDBGRQ_POS             (0U)
#define DBGC_T_MCUCTL_EDBGRQ                 ((uint32_t)0x00000001U)
#define DBGC_T_MCUCTL_RESTART_POS            (1U)
#define DBGC_T_MCUCTL_RESTART                ((uint32_t)0x00000002U)
#define DBGC_T_MCUCTL_DIRQ_POS               (8U)
#define DBGC_T_MCUCTL_DIRQ                   ((uint32_t)0x00000100U)

/*  Bit definition for DBGC_T_FMCCTL register  */
#define DBGC_T_FMCCTL_ERASEREQ_POS           (0U)
#define DBGC_T_FMCCTL_ERASEREQ               ((uint32_t)0x00000001U)
#define DBGC_T_FMCCTL_ERASEACK_POS           (1U)
#define DBGC_T_FMCCTL_ERASEACK               ((uint32_t)0x00000002U)
#define DBGC_T_FMCCTL_ERASEERR_POS           (2U)
#define DBGC_T_FMCCTL_ERASEERR               ((uint32_t)0x00000004U)


/*******************************************************************************
                Bit definition for Peripheral DMA
*******************************************************************************/
/*  Bit definition for DMA_EN register  */
#define DMA_EN_EN_POS                        (0U)
#define DMA_EN_EN                            ((uint32_t)0x00000001U)

/*  Bit definition for DMA_INTSTAT0 register  */
#define DMA_INTSTAT0_TRNERR_POS              (0U)
#define DMA_INTSTAT0_TRNERR                  ((uint32_t)0x00000003U)
#define DMA_INTSTAT0_TRNERR_0                ((uint32_t)0x00000001U)
#define DMA_INTSTAT0_TRNERR_1                ((uint32_t)0x00000002U)
#define DMA_INTSTAT0_REQERR_POS              (16U)
#define DMA_INTSTAT0_REQERR                  ((uint32_t)0x00030000U)
#define DMA_INTSTAT0_REQERR_0                ((uint32_t)0x00010000U)
#define DMA_INTSTAT0_REQERR_1                ((uint32_t)0x00020000U)

/*  Bit definition for DMA_INTSTAT1 register  */
#define DMA_INTSTAT1_TC_POS                  (0U)
#define DMA_INTSTAT1_TC                      ((uint32_t)0x00000003U)
#define DMA_INTSTAT1_TC_0                    ((uint32_t)0x00000001U)
#define DMA_INTSTAT1_TC_1                    ((uint32_t)0x00000002U)
#define DMA_INTSTAT1_BTC_POS                 (16U)
#define DMA_INTSTAT1_BTC                     ((uint32_t)0x00030000U)
#define DMA_INTSTAT1_BTC_0                   ((uint32_t)0x00010000U)
#define DMA_INTSTAT1_BTC_1                   ((uint32_t)0x00020000U)

/*  Bit definition for DMA_INTMASK0 register  */
#define DMA_INTMASK0_MSKTRNERR_POS           (0U)
#define DMA_INTMASK0_MSKTRNERR               ((uint32_t)0x00000003U)
#define DMA_INTMASK0_MSKTRNERR_0             ((uint32_t)0x00000001U)
#define DMA_INTMASK0_MSKTRNERR_1             ((uint32_t)0x00000002U)
#define DMA_INTMASK0_MSKREQERR_POS           (16U)
#define DMA_INTMASK0_MSKREQERR               ((uint32_t)0x00030000U)
#define DMA_INTMASK0_MSKREQERR_0             ((uint32_t)0x00010000U)
#define DMA_INTMASK0_MSKREQERR_1             ((uint32_t)0x00020000U)

