SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*  Bit definition for DMA_DAR1 register  */
#define DMA_DAR1_DAR1                        ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DMA_CH1CTL0 register  */
#define DMA_CH1CTL0_BLKSIZE_POS              (0U)
#define DMA_CH1CTL0_BLKSIZE                  ((uint32_t)0x000000FFU)
#define DMA_CH1CTL0_BLKSIZE_0                ((uint32_t)0x00000001U)
#define DMA_CH1CTL0_BLKSIZE_1                ((uint32_t)0x00000002U)
#define DMA_CH1CTL0_BLKSIZE_2                ((uint32_t)0x00000004U)
#define DMA_CH1CTL0_BLKSIZE_3                ((uint32_t)0x00000008U)
#define DMA_CH1CTL0_BLKSIZE_4                ((uint32_t)0x00000010U)
#define DMA_CH1CTL0_BLKSIZE_5                ((uint32_t)0x00000020U)
#define DMA_CH1CTL0_BLKSIZE_6                ((uint32_t)0x00000040U)
#define DMA_CH1CTL0_BLKSIZE_7                ((uint32_t)0x00000080U)
#define DMA_CH1CTL0_CNT_POS                  (8U)
#define DMA_CH1CTL0_CNT                      ((uint32_t)0x0003FF00U)
#define DMA_CH1CTL0_CNT_0                    ((uint32_t)0x00000100U)
#define DMA_CH1CTL0_CNT_1                    ((uint32_t)0x00000200U)
#define DMA_CH1CTL0_CNT_2                    ((uint32_t)0x00000400U)
#define DMA_CH1CTL0_CNT_3                    ((uint32_t)0x00000800U)
#define DMA_CH1CTL0_CNT_4                    ((uint32_t)0x00001000U)
#define DMA_CH1CTL0_CNT_5                    ((uint32_t)0x00002000U)
#define DMA_CH1CTL0_CNT_6                    ((uint32_t)0x00004000U)
#define DMA_CH1CTL0_CNT_7                    ((uint32_t)0x00008000U)
#define DMA_CH1CTL0_CNT_8                    ((uint32_t)0x00010000U)
#define DMA_CH1CTL0_CNT_9                    ((uint32_t)0x00020000U)
#define DMA_CH1CTL0_LLP_POS                  (18U)
#define DMA_CH1CTL0_LLP                      ((uint32_t)0x0FFC0000U)
#define DMA_CH1CTL0_LLP_0                    ((uint32_t)0x00040000U)
#define DMA_CH1CTL0_LLP_1                    ((uint32_t)0x00080000U)
#define DMA_CH1CTL0_LLP_2                    ((uint32_t)0x00100000U)
#define DMA_CH1CTL0_LLP_3                    ((uint32_t)0x00200000U)
#define DMA_CH1CTL0_LLP_4                    ((uint32_t)0x00400000U)
#define DMA_CH1CTL0_LLP_5                    ((uint32_t)0x00800000U)
#define DMA_CH1CTL0_LLP_6                    ((uint32_t)0x01000000U)
#define DMA_CH1CTL0_LLP_7                    ((uint32_t)0x02000000U)
#define DMA_CH1CTL0_LLP_8                    ((uint32_t)0x04000000U)
#define DMA_CH1CTL0_LLP_9                    ((uint32_t)0x08000000U)
#define DMA_CH1CTL0_LLPEN_POS                (28U)
#define DMA_CH1CTL0_LLPEN                    ((uint32_t)0x10000000U)
#define DMA_CH1CTL0_LLPRUN_POS               (29U)
#define DMA_CH1CTL0_LLPRUN                   ((uint32_t)0x20000000U)
#define DMA_CH1CTL0_HSIZE_POS                (30U)
#define DMA_CH1CTL0_HSIZE                    ((uint32_t)0xC0000000U)
#define DMA_CH1CTL0_HSIZE_0                  ((uint32_t)0x40000000U)
#define DMA_CH1CTL0_HSIZE_1                  ((uint32_t)0x80000000U)

/*  Bit definition for DMA_CH1CTL1 register  */
#define DMA_CH1CTL1_OFFSET_POS               (0U)
#define DMA_CH1CTL1_OFFSET                   ((uint32_t)0x0000FFFFU)
#define DMA_CH1CTL1_OFFSET_0                 ((uint32_t)0x00000001U)
#define DMA_CH1CTL1_OFFSET_1                 ((uint32_t)0x00000002U)
#define DMA_CH1CTL1_OFFSET_2                 ((uint32_t)0x00000004U)
#define DMA_CH1CTL1_OFFSET_3                 ((uint32_t)0x00000008U)
#define DMA_CH1CTL1_OFFSET_4                 ((uint32_t)0x00000010U)
#define DMA_CH1CTL1_OFFSET_5                 ((uint32_t)0x00000020U)
#define DMA_CH1CTL1_OFFSET_6                 ((uint32_t)0x00000040U)
#define DMA_CH1CTL1_OFFSET_7                 ((uint32_t)0x00000080U)
#define DMA_CH1CTL1_OFFSET_8                 ((uint32_t)0x00000100U)
#define DMA_CH1CTL1_OFFSET_9                 ((uint32_t)0x00000200U)
#define DMA_CH1CTL1_OFFSET_10                ((uint32_t)0x00000400U)
#define DMA_CH1CTL1_OFFSET_11                ((uint32_t)0x00000800U)
#define DMA_CH1CTL1_OFFSET_12                ((uint32_t)0x00001000U)
#define DMA_CH1CTL1_OFFSET_13                ((uint32_t)0x00002000U)
#define DMA_CH1CTL1_OFFSET_14                ((uint32_t)0x00004000U)
#define DMA_CH1CTL1_OFFSET_15                ((uint32_t)0x00008000U)
#define DMA_CH1CTL1_RPTNSCNT_POS             (16U)
#define DMA_CH1CTL1_RPTNSCNT                 ((uint32_t)0x00FF0000U)
#define DMA_CH1CTL1_RPTNSCNT_0               ((uint32_t)0x00010000U)
#define DMA_CH1CTL1_RPTNSCNT_1               ((uint32_t)0x00020000U)
#define DMA_CH1CTL1_RPTNSCNT_2               ((uint32_t)0x00040000U)
#define DMA_CH1CTL1_RPTNSCNT_3               ((uint32_t)0x00080000U)
#define DMA_CH1CTL1_RPTNSCNT_4               ((uint32_t)0x00100000U)
#define DMA_CH1CTL1_RPTNSCNT_5               ((uint32_t)0x00200000U)
#define DMA_CH1CTL1_RPTNSCNT_6               ((uint32_t)0x00400000U)
#define DMA_CH1CTL1_RPTNSCNT_7               ((uint32_t)0x00800000U)
#define DMA_CH1CTL1_RPTNSEN_POS              (24U)
#define DMA_CH1CTL1_RPTNSEN                  ((uint32_t)0x01000000U)
#define DMA_CH1CTL1_RPTNSSEL_POS             (25U)
#define DMA_CH1CTL1_RPTNSSEL                 ((uint32_t)0x06000000U)
#define DMA_CH1CTL1_RPTNSSEL_0               ((uint32_t)0x02000000U)
#define DMA_CH1CTL1_RPTNSSEL_1               ((uint32_t)0x04000000U)
#define DMA_CH1CTL1_SINC_POS                 (28U)
#define DMA_CH1CTL1_SINC                     ((uint32_t)0x30000000U)
#define DMA_CH1CTL1_SINC_0                   ((uint32_t)0x10000000U)
#define DMA_CH1CTL1_SINC_1                   ((uint32_t)0x20000000U)
#define DMA_CH1CTL1_DINC_POS                 (30U)
#define DMA_CH1CTL1_DINC                     ((uint32_t)0xC0000000U)
#define DMA_CH1CTL1_DINC_0                   ((uint32_t)0x40000000U)
#define DMA_CH1CTL1_DINC_1                   ((uint32_t)0x80000000U)


/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT_POS                  (0U)
#define EFM_FAPRT_FAPRT                      ((uint32_t)0x0000FFFFU)
#define EFM_FAPRT_FAPRT_0                    ((uint32_t)0x00000001U)
#define EFM_FAPRT_FAPRT_1                    ((uint32_t)0x00000002U)
#define EFM_FAPRT_FAPRT_2                    ((uint32_t)0x00000004U)
#define EFM_FAPRT_FAPRT_3                    ((uint32_t)0x00000008U)
#define EFM_FAPRT_FAPRT_4                    ((uint32_t)0x00000010U)
#define EFM_FAPRT_FAPRT_5                    ((uint32_t)0x00000020U)
#define EFM_FAPRT_FAPRT_6                    ((uint32_t)0x00000040U)
#define EFM_FAPRT_FAPRT_7                    ((uint32_t)0x00000080U)
#define EFM_FAPRT_FAPRT_8                    ((uint32_t)0x00000100U)
#define EFM_FAPRT_FAPRT_9                    ((uint32_t)0x00000200U)
#define EFM_FAPRT_FAPRT_10                   ((uint32_t)0x00000400U)
#define EFM_FAPRT_FAPRT_11                   ((uint32_t)0x00000800U)
#define EFM_FAPRT_FAPRT_12                   ((uint32_t)0x00001000U)
#define EFM_FAPRT_FAPRT_13                   ((uint32_t)0x00002000U)
#define EFM_FAPRT_FAPRT_14                   ((uint32_t)0x00004000U)
#define EFM_FAPRT_FAPRT_15                   ((uint32_t)0x00008000U)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_FSTP_POS                    (0U)
#define EFM_FSTP_FSTP                        ((uint32_t)0x00000001U)

