SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*  Bit definition for PORT_POER3 register  */
#define PORT_POER3_POUTE0_POS                (0U)
#define PORT_POER3_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER3_POUTE1_POS                (1U)
#define PORT_POER3_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER4 register  */
#define PORT_POER4_POUTE0_POS                (0U)
#define PORT_POER4_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER4_POUTE1_POS                (1U)
#define PORT_POER4_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER5 register  */
#define PORT_POER5_POUTE0_POS                (0U)
#define PORT_POER5_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER5_POUTE1_POS                (1U)
#define PORT_POER5_POUTE1                    ((uint8_t)0x02U)

/*  Bit definition for PORT_POER6 register  */
#define PORT_POER6_POUTE0_POS                (0U)
#define PORT_POER6_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER6_POUTE1_POS                (1U)
#define PORT_POER6_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER6_POUTE2_POS                (2U)
#define PORT_POER6_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER6_POUTE3_POS                (3U)
#define PORT_POER6_POUTE3                    ((uint8_t)0x08U)

/*  Bit definition for PORT_POER7 register  */
#define PORT_POER7_POUTE0_POS                (0U)
#define PORT_POER7_POUTE0                    ((uint8_t)0x01U)
#define PORT_POER7_POUTE1_POS                (1U)
#define PORT_POER7_POUTE1                    ((uint8_t)0x02U)
#define PORT_POER7_POUTE2_POS                (2U)
#define PORT_POER7_POUTE2                    ((uint8_t)0x04U)
#define PORT_POER7_POUTE3_POS                (3U)
#define PORT_POER7_POUTE3                    ((uint8_t)0x08U)
#define PORT_POER7_POUTE4_POS                (4U)
#define PORT_POER7_POUTE4                    ((uint8_t)0x10U)
#define PORT_POER7_POUTE5_POS                (5U)
#define PORT_POER7_POUTE5                    ((uint8_t)0x20U)

/*  Bit definition for PORT_POER12 register  */
#define PORT_POER12_POUTE0_POS               (0U)
#define PORT_POER12_POUTE0                   ((uint8_t)0x01U)
#define PORT_POER12_POUTE1_POS               (1U)
#define PORT_POER12_POUTE1                   ((uint8_t)0x02U)
#define PORT_POER12_POUTE2_POS               (2U)
#define PORT_POER12_POUTE2                   ((uint8_t)0x04U)
#define PORT_POER12_POUTE3_POS               (3U)
#define PORT_POER12_POUTE3                   ((uint8_t)0x08U)
#define PORT_POER12_POUTE4_POS               (4U)
#define PORT_POER12_POUTE4                   ((uint8_t)0x10U)

/*  Bit definition for PORT_POER13 register  */
#define PORT_POER13_POUTE0_POS               (0U)
#define PORT_POER13_POUTE0                   ((uint8_t)0x01U)
#define PORT_POER13_POUTE7_POS               (7U)
#define PORT_POER13_POUTE7                   ((uint8_t)0x80U)

/*  Bit definition for PORT_POER14 register  */
#define PORT_POER14_POUTE0_POS               (0U)
#define PORT_POER14_POUTE0                   ((uint8_t)0x01U)
#define PORT_POER14_POUTE6_POS               (6U)
#define PORT_POER14_POUTE6                   ((uint8_t)0x40U)
#define PORT_POER14_POUTE7_POS               (7U)
#define PORT_POER14_POUTE7                   ((uint8_t)0x80U)

/*  Bit definition for PORT_POSR0 register  */
#define PORT_POSR0_POS0_POS                  (0U)
#define PORT_POSR0_POS0                      ((uint8_t)0x01U)
#define PORT_POSR0_POS1_POS                  (1U)
#define PORT_POSR0_POS1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POSR1 register  */
#define PORT_POSR1_POS0_POS                  (0U)
#define PORT_POSR1_POS0                      ((uint8_t)0x01U)
#define PORT_POSR1_POS1_POS                  (1U)
#define PORT_POSR1_POS1                      ((uint8_t)0x02U)
#define PORT_POSR1_POS2_POS                  (2U)
#define PORT_POSR1_POS2                      ((uint8_t)0x04U)
#define PORT_POSR1_POS3_POS                  (3U)
#define PORT_POSR1_POS3                      ((uint8_t)0x08U)
#define PORT_POSR1_POS4_POS                  (4U)
#define PORT_POSR1_POS4                      ((uint8_t)0x10U)
#define PORT_POSR1_POS5_POS                  (5U)
#define PORT_POSR1_POS5                      ((uint8_t)0x20U)
#define PORT_POSR1_POS6_POS                  (6U)
#define PORT_POSR1_POS6                      ((uint8_t)0x40U)
#define PORT_POSR1_POS7_POS                  (7U)
#define PORT_POSR1_POS7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_POSR2 register  */
#define PORT_POSR2_POS0_POS                  (0U)
#define PORT_POSR2_POS0                      ((uint8_t)0x01U)
#define PORT_POSR2_POS1_POS                  (1U)
#define PORT_POSR2_POS1                      ((uint8_t)0x02U)
#define PORT_POSR2_POS2_POS                  (2U)
#define PORT_POSR2_POS2                      ((uint8_t)0x04U)
#define PORT_POSR2_POS3_POS                  (3U)
#define PORT_POSR2_POS3                      ((uint8_t)0x08U)
#define PORT_POSR2_POS4_POS                  (4U)
#define PORT_POSR2_POS4                      ((uint8_t)0x10U)
#define PORT_POSR2_POS5_POS                  (5U)
#define PORT_POSR2_POS5                      ((uint8_t)0x20U)
#define PORT_POSR2_POS6_POS                  (6U)
#define PORT_POSR2_POS6                      ((uint8_t)0x40U)
#define PORT_POSR2_POS7_POS                  (7U)
#define PORT_POSR2_POS7                      ((uint8_t)0x80U)

/*  Bit definition for PORT_POSR3 register  */
#define PORT_POSR3_POS0_POS                  (0U)
#define PORT_POSR3_POS0                      ((uint8_t)0x01U)
#define PORT_POSR3_POS1_POS                  (1U)
#define PORT_POSR3_POS1                      ((uint8_t)0x02U)

/*  Bit definition for PORT_POSR4 register  */
#define PORT_POSR4_POS0_POS                  (0U)
#define PORT_POSR4_POS0                      ((uint8_t)0x01U)
#define PORT_POSR4_POS1_POS                  (1U)
#define PORT_POSR4_POS1                      ((uint8_t)0x02U)

