SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*  Bit definition for PORT_PSPCR register  */
#define PORT_PSPCR_SPFE_POS                  (0U)
#define PORT_PSPCR_SPFE                      ((uint16_t)0x0003U)
#define PORT_PSPCR_SPFE_0                    ((uint16_t)0x0001U)
#define PORT_PSPCR_SPFE_1                    ((uint16_t)0x0002U)

/*  Bit definition for PORT_PCCR register  */
#define PORT_PCCR_RDWT_POS                   (14U)
#define PORT_PCCR_RDWT                       ((uint16_t)0xC000U)
#define PORT_PCCR_RDWT_0                     ((uint16_t)0x4000U)
#define PORT_PCCR_RDWT_1                     ((uint16_t)0x8000U)

/*  Bit definition for PORT_PINAER register  */
#define PORT_PINAER_PINAE0_POS               (0U)
#define PORT_PINAER_PINAE0                   ((uint16_t)0x0001U)
#define PORT_PINAER_PINAE1_POS               (1U)
#define PORT_PINAER_PINAE1                   ((uint16_t)0x0002U)
#define PORT_PINAER_PINAE2_POS               (2U)
#define PORT_PINAER_PINAE2                   ((uint16_t)0x0004U)
#define PORT_PINAER_PINAE3_POS               (3U)
#define PORT_PINAER_PINAE3                   ((uint16_t)0x0008U)
#define PORT_PINAER_PINAE4_POS               (4U)
#define PORT_PINAER_PINAE4                   ((uint16_t)0x0010U)
#define PORT_PINAER_PINAE5_POS               (5U)
#define PORT_PINAER_PINAE5                   ((uint16_t)0x0020U)
#define PORT_PINAER_PINAE6_POS               (6U)
#define PORT_PINAER_PINAE6                   ((uint16_t)0x0040U)
#define PORT_PINAER_PINAE7_POS               (7U)
#define PORT_PINAER_PINAE7                   ((uint16_t)0x0080U)
#define PORT_PINAER_PINAE12_POS              (12U)
#define PORT_PINAER_PINAE12                  ((uint16_t)0x1000U)
#define PORT_PINAER_PINAE13_POS              (13U)
#define PORT_PINAER_PINAE13                  ((uint16_t)0x2000U)
#define PORT_PINAER_PINAE14_POS              (14U)
#define PORT_PINAER_PINAE14                  ((uint16_t)0x4000U)

/*  Bit definition for PORT_PWPR register  */
#define PORT_PWPR_WE_POS                     (0U)
#define PORT_PWPR_WE                         ((uint16_t)0x0001U)
#define PORT_PWPR_WP_POS                     (8U)
#define PORT_PWPR_WP                         ((uint16_t)0xFF00U)
#define PORT_PWPR_WP_0                       ((uint16_t)0x0100U)
#define PORT_PWPR_WP_1                       ((uint16_t)0x0200U)
#define PORT_PWPR_WP_2                       ((uint16_t)0x0400U)
#define PORT_PWPR_WP_3                       ((uint16_t)0x0800U)
#define PORT_PWPR_WP_4                       ((uint16_t)0x1000U)
#define PORT_PWPR_WP_5                       ((uint16_t)0x2000U)
#define PORT_PWPR_WP_6                       ((uint16_t)0x4000U)
#define PORT_PWPR_WP_7                       ((uint16_t)0x8000U)


/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_STPMCR register  */
#define PWC_STPMCR_CKSHRC_POS                (1U)
#define PWC_STPMCR_CKSHRC                    ((uint8_t)0x02U)
#define PWC_STPMCR_HAPORDIS_POS              (3U)
#define PWC_STPMCR_HAPORDIS                  ((uint8_t)0x08U)
#define PWC_STPMCR_STOP_POS                  (7U)
#define PWC_STPMCR_STOP                      ((uint8_t)0x80U)

/*  Bit definition for PWC_PWRC register  */
#define PWC_PWRC_PWDRV_POS                   (0U)
#define PWC_PWRC_PWDRV                       ((uint8_t)0x07U)
#define PWC_PWRC_PWDRV_0                     ((uint8_t)0x01U)
#define PWC_PWRC_PWDRV_1                     ((uint8_t)0x02U)
#define PWC_PWRC_PWDRV_2                     ((uint8_t)0x04U)
#define PWC_PWRC_PWMONSEL_POS                (4U)
#define PWC_PWRC_PWMONSEL                    ((uint8_t)0x10U)
#define PWC_PWRC_PWMONE_POS                  (5U)
#define PWC_PWRC_PWMONE                      ((uint8_t)0x20U)
#define PWC_PWRC_LPDADJ_POS                  (6U)
#define PWC_PWRC_LPDADJ                      ((uint8_t)0x40U)

/*  Bit definition for PWC_RAMCR register  */
#define PWC_RAMCR_RPRTA_POS                  (0U)
#define PWC_RAMCR_RPRTA                      ((uint8_t)0x03U)
#define PWC_RAMCR_RPRTA_0                    ((uint8_t)0x01U)
#define PWC_RAMCR_RPRTA_1                    ((uint8_t)0x02U)
#define PWC_RAMCR_RPERDIS_POS                (4U)
#define PWC_RAMCR_RPERDIS                    ((uint8_t)0x10U)
#define PWC_RAMCR_RPEF_POS                   (5U)
#define PWC_RAMCR_RPEF                       ((uint8_t)0x20U)

/*  Bit definition for PWC_LVDCSR register  */
#define PWC_LVDCSR_EXVCCINEN_POS             (0U)
#define PWC_LVDCSR_EXVCCINEN                 ((uint8_t)0x01U)
#define PWC_LVDCSR_LVIF_POS                  (3U)
#define PWC_LVDCSR_LVIF                      ((uint8_t)0x08U)
#define PWC_LVDCSR_DETF_POS                  (4U)
#define PWC_LVDCSR_DETF                      ((uint8_t)0x10U)
#define PWC_LVDCSR_CMPOE_POS                 (7U)
#define PWC_LVDCSR_CMPOE                     ((uint8_t)0x80U)

/*  Bit definition for PWC_FPRC register  */
#define PWC_FPRC_CKRWE_POS                   (0U)
#define PWC_FPRC_CKRWE                       ((uint16_t)0x0001U)
#define PWC_FPRC_PWRWE_POS                   (1U)
#define PWC_FPRC_PWRWE                       ((uint16_t)0x0002U)
#define PWC_FPRC_FPRCB2_POS                  (2U)
#define PWC_FPRC_FPRCB2                      ((uint16_t)0x0004U)
#define PWC_FPRC_LVRWE_POS                   (3U)
#define PWC_FPRC_LVRWE                       ((uint16_t)0x0008U)
#define PWC_FPRC_FPRCB4_POS                  (4U)
#define PWC_FPRC_FPRCB4                      ((uint16_t)0x0010U)
#define PWC_FPRC_FPRCB5_POS                  (5U)
#define PWC_FPRC_FPRCB5                      ((uint16_t)0x0020U)
#define PWC_FPRC_FPRCB6_POS                  (6U)
#define PWC_FPRC_FPRCB6                      ((uint16_t)0x0040U)
#define PWC_FPRC_FPRCB7_POS                  (7U)
#define PWC_FPRC_FPRCB7                      ((uint16_t)0x0080U)
#define PWC_FPRC_FPRCWE_POS                  (8U)
#define PWC_FPRC_FPRCWE                      ((uint16_t)0xFF00U)
#define PWC_FPRC_FPRCWE_0                    ((uint16_t)0x0100U)
#define PWC_FPRC_FPRCWE_1                    ((uint16_t)0x0200U)
#define PWC_FPRC_FPRCWE_2                    ((uint16_t)0x0400U)
#define PWC_FPRC_FPRCWE_3                    ((uint16_t)0x0800U)
#define PWC_FPRC_FPRCWE_4                    ((uint16_t)0x1000U)
#define PWC_FPRC_FPRCWE_5                    ((uint16_t)0x2000U)
#define PWC_FPRC_FPRCWE_6                    ((uint16_t)0x4000U)
#define PWC_FPRC_FPRCWE_7                    ((uint16_t)0x8000U)

/*  Bit definition for PWC_DBGC register  */
#define PWC_DBGC_DBGEN_POS                   (0U)
#define PWC_DBGC_DBGEN                       ((uint8_t)0x01U)


