SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral RMU
*******************************************************************************/
/*  Bit definition for RMU_RSTF0 register  */
#define RMU_RSTF0_PORF_POS                   (0U)
#define RMU_RSTF0_PORF                       ((uint16_t)0x0001U)
#define RMU_RSTF0_PINRF_POS                  (1U)
#define RMU_RSTF0_PINRF                      ((uint16_t)0x0002U)
#define RMU_RSTF0_LVRF_POS                   (2U)
#define RMU_RSTF0_LVRF                       ((uint16_t)0x0004U)
#define RMU_RSTF0_WDRF_POS                   (5U)
#define RMU_RSTF0_WDRF                       ((uint16_t)0x0020U)
#define RMU_RSTF0_SWRF_POS                   (8U)
#define RMU_RSTF0_SWRF                       ((uint16_t)0x0100U)
#define RMU_RSTF0_RAMPERF_POS                (10U)
#define RMU_RSTF0_RAMPERF                    ((uint16_t)0x0400U)
#define RMU_RSTF0_CPULKUPRF_POS              (12U)
#define RMU_RSTF0_CPULKUPRF                  ((uint16_t)0x1000U)
#define RMU_RSTF0_XTALERF_POS                (13U)
#define RMU_RSTF0_XTALERF                    ((uint16_t)0x2000U)
#define RMU_RSTF0_MULTIRF_POS                (14U)
#define RMU_RSTF0_MULTIRF                    ((uint16_t)0x4000U)
#define RMU_RSTF0_CLRF_POS                   (15U)
#define RMU_RSTF0_CLRF                       ((uint16_t)0x8000U)


/*******************************************************************************
                Bit definition for Peripheral SPI
*******************************************************************************/
/*  Bit definition for SPI_DR register  */
#define SPI_DR_SPD_POS                       (0U)
#define SPI_DR_SPD                           ((uint32_t)0x0000FFFFU)
#define SPI_DR_SPD_0                         ((uint32_t)0x00000001U)
#define SPI_DR_SPD_1                         ((uint32_t)0x00000002U)
#define SPI_DR_SPD_2                         ((uint32_t)0x00000004U)
#define SPI_DR_SPD_3                         ((uint32_t)0x00000008U)
#define SPI_DR_SPD_4                         ((uint32_t)0x00000010U)
#define SPI_DR_SPD_5                         ((uint32_t)0x00000020U)
#define SPI_DR_SPD_6                         ((uint32_t)0x00000040U)
#define SPI_DR_SPD_7                         ((uint32_t)0x00000080U)
#define SPI_DR_SPD_8                         ((uint32_t)0x00000100U)
#define SPI_DR_SPD_9                         ((uint32_t)0x00000200U)
#define SPI_DR_SPD_10                        ((uint32_t)0x00000400U)
#define SPI_DR_SPD_11                        ((uint32_t)0x00000800U)
#define SPI_DR_SPD_12                        ((uint32_t)0x00001000U)
#define SPI_DR_SPD_13                        ((uint32_t)0x00002000U)
#define SPI_DR_SPD_14                        ((uint32_t)0x00004000U)
#define SPI_DR_SPD_15                        ((uint32_t)0x00008000U)

/*  Bit definition for SPI_CR1 register  */
#define SPI_CR1_SPIMDS_POS                   (0U)
#define SPI_CR1_SPIMDS                       ((uint32_t)0x00000001U)
#define SPI_CR1_TXMDS_POS                    (1U)
#define SPI_CR1_TXMDS                        ((uint32_t)0x00000002U)
#define SPI_CR1_MSTR_POS                     (3U)
#define SPI_CR1_MSTR                         ((uint32_t)0x00000008U)
#define SPI_CR1_SPLPBK_POS                   (4U)
#define SPI_CR1_SPLPBK                       ((uint32_t)0x00000010U)
#define SPI_CR1_SPLPBK2_POS                  (5U)
#define SPI_CR1_SPLPBK2                      ((uint32_t)0x00000020U)
#define SPI_CR1_SPE_POS                      (6U)
#define SPI_CR1_SPE                          ((uint32_t)0x00000040U)
#define SPI_CR1_EIE_POS                      (8U)
#define SPI_CR1_EIE                          ((uint32_t)0x00000100U)
#define SPI_CR1_TXIE_POS                     (9U)
#define SPI_CR1_TXIE                         ((uint32_t)0x00000200U)
#define SPI_CR1_RXIE_POS                     (10U)
#define SPI_CR1_RXIE                         ((uint32_t)0x00000400U)
#define SPI_CR1_IDIE_POS                     (11U)
#define SPI_CR1_IDIE                         ((uint32_t)0x00000800U)
#define SPI_CR1_MODFE_POS                    (12U)
#define SPI_CR1_MODFE                        ((uint32_t)0x00001000U)
#define SPI_CR1_PATE_POS                     (13U)
#define SPI_CR1_PATE                         ((uint32_t)0x00002000U)
#define SPI_CR1_PAOE_POS                     (14U)
#define SPI_CR1_PAOE                         ((uint32_t)0x00004000U)
#define SPI_CR1_PAE_POS                      (15U)
#define SPI_CR1_PAE                          ((uint32_t)0x00008000U)

/*  Bit definition for SPI_CFG1 register  */
#define SPI_CFG1_SS0PV_POS                   (8U)
#define SPI_CFG1_SS0PV                       ((uint32_t)0x00000100U)

/*  Bit definition for SPI_SR register  */
#define SPI_SR_OVRERF_POS                    (0U)
#define SPI_SR_OVRERF                        ((uint32_t)0x00000001U)
#define SPI_SR_IDLNF_POS                     (1U)
#define SPI_SR_IDLNF                         ((uint32_t)0x00000002U)
#define SPI_SR_MODFERF_POS                   (2U)
#define SPI_SR_MODFERF                       ((uint32_t)0x00000004U)
#define SPI_SR_PERF_POS                      (3U)
#define SPI_SR_PERF                          ((uint32_t)0x00000008U)
#define SPI_SR_UDRERF_POS                    (4U)
#define SPI_SR_UDRERF                        ((uint32_t)0x00000010U)
#define SPI_SR_TDEF_POS                      (5U)
#define SPI_SR_TDEF                          ((uint32_t)0x00000020U)
#define SPI_SR_RDFF_POS                      (7U)
#define SPI_SR_RDFF                          ((uint32_t)0x00000080U)

/*  Bit definition for SPI_CFG2 register  */
#define SPI_CFG2_CPHA_POS                    (0U)
#define SPI_CFG2_CPHA                        ((uint32_t)0x00000001U)
#define SPI_CFG2_CPOL_POS                    (1U)
#define SPI_CFG2_CPOL                        ((uint32_t)0x00000002U)
#define SPI_CFG2_MBR_POS                     (2U)
#define SPI_CFG2_MBR                         ((uint32_t)0x0000001CU)
#define SPI_CFG2_MBR_0                       ((uint32_t)0x00000004U)
#define SPI_CFG2_MBR_1                       ((uint32_t)0x00000008U)
#define SPI_CFG2_MBR_2                       ((uint32_t)0x00000010U)
#define SPI_CFG2_DSIZE_POS                   (8U)
#define SPI_CFG2_DSIZE                       ((uint32_t)0x00000100U)
#define SPI_CFG2_LSBF_POS                    (12U)
#define SPI_CFG2_LSBF                        ((uint32_t)0x00001000U)


