SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral SWDT
*******************************************************************************/
/*  Bit definition for SWDT_CR register  */
#define SWDT_CR_PERI_POS                     (0U)
#define SWDT_CR_PERI                         ((uint32_t)0x00000003U)
#define SWDT_CR_PERI_0                       ((uint32_t)0x00000001U)
#define SWDT_CR_PERI_1                       ((uint32_t)0x00000002U)
#define SWDT_CR_CKS_POS                      (4U)
#define SWDT_CR_CKS                          ((uint32_t)0x000000F0U)
#define SWDT_CR_CKS_0                        ((uint32_t)0x00000010U)
#define SWDT_CR_CKS_1                        ((uint32_t)0x00000020U)
#define SWDT_CR_CKS_2                        ((uint32_t)0x00000040U)
#define SWDT_CR_CKS_3                        ((uint32_t)0x00000080U)
#define SWDT_CR_WDPT_POS                     (8U)
#define SWDT_CR_WDPT                         ((uint32_t)0x00000F00U)
#define SWDT_CR_WDPT_0                       ((uint32_t)0x00000100U)
#define SWDT_CR_WDPT_1                       ((uint32_t)0x00000200U)
#define SWDT_CR_WDPT_2                       ((uint32_t)0x00000400U)
#define SWDT_CR_WDPT_3                       ((uint32_t)0x00000800U)
#define SWDT_CR_SLPOFF_POS                   (16U)
#define SWDT_CR_SLPOFF                       ((uint32_t)0x00010000U)
#define SWDT_CR_ITS_POS                      (31U)
#define SWDT_CR_ITS                          ((uint32_t)0x80000000U)

/*  Bit definition for SWDT_SR register  */
#define SWDT_SR_CNT_POS                      (0U)
#define SWDT_SR_CNT                          ((uint32_t)0x0000FFFFU)
#define SWDT_SR_CNT_0                        ((uint32_t)0x00000001U)
#define SWDT_SR_CNT_1                        ((uint32_t)0x00000002U)
#define SWDT_SR_CNT_2                        ((uint32_t)0x00000004U)
#define SWDT_SR_CNT_3                        ((uint32_t)0x00000008U)
#define SWDT_SR_CNT_4                        ((uint32_t)0x00000010U)
#define SWDT_SR_CNT_5                        ((uint32_t)0x00000020U)
#define SWDT_SR_CNT_6                        ((uint32_t)0x00000040U)
#define SWDT_SR_CNT_7                        ((uint32_t)0x00000080U)
#define SWDT_SR_CNT_8                        ((uint32_t)0x00000100U)
#define SWDT_SR_CNT_9                        ((uint32_t)0x00000200U)
#define SWDT_SR_CNT_10                       ((uint32_t)0x00000400U)
#define SWDT_SR_CNT_11                       ((uint32_t)0x00000800U)
#define SWDT_SR_CNT_12                       ((uint32_t)0x00001000U)
#define SWDT_SR_CNT_13                       ((uint32_t)0x00002000U)
#define SWDT_SR_CNT_14                       ((uint32_t)0x00004000U)
#define SWDT_SR_CNT_15                       ((uint32_t)0x00008000U)
#define SWDT_SR_UDF_POS                      (16U)
#define SWDT_SR_UDF                          ((uint32_t)0x00010000U)
#define SWDT_SR_REF_POS                      (17U)
#define SWDT_SR_REF                          ((uint32_t)0x00020000U)

/*  Bit definition for SWDT_RR register  */
#define SWDT_RR_RF_POS                       (0U)
#define SWDT_RR_RF                           ((uint32_t)0x0000FFFFU)
#define SWDT_RR_RF_0                         ((uint32_t)0x00000001U)
#define SWDT_RR_RF_1                         ((uint32_t)0x00000002U)
#define SWDT_RR_RF_2                         ((uint32_t)0x00000004U)
#define SWDT_RR_RF_3                         ((uint32_t)0x00000008U)
#define SWDT_RR_RF_4                         ((uint32_t)0x00000010U)
#define SWDT_RR_RF_5                         ((uint32_t)0x00000020U)
#define SWDT_RR_RF_6                         ((uint32_t)0x00000040U)
#define SWDT_RR_RF_7                         ((uint32_t)0x00000080U)
#define SWDT_RR_RF_8                         ((uint32_t)0x00000100U)
#define SWDT_RR_RF_9                         ((uint32_t)0x00000200U)
#define SWDT_RR_RF_10                        ((uint32_t)0x00000400U)
#define SWDT_RR_RF_11                        ((uint32_t)0x00000800U)
#define SWDT_RR_RF_12                        ((uint32_t)0x00001000U)
#define SWDT_RR_RF_13                        ((uint32_t)0x00002000U)
#define SWDT_RR_RF_14                        ((uint32_t)0x00004000U)
#define SWDT_RR_RF_15                        ((uint32_t)0x00008000U)


/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA_POS                  (0U)
#define TMR0_CNTAR_CNTA                      ((uint32_t)0x0000FFFFU)
#define TMR0_CNTAR_CNTA_0                    ((uint32_t)0x00000001U)
#define TMR0_CNTAR_CNTA_1                    ((uint32_t)0x00000002U)
#define TMR0_CNTAR_CNTA_2                    ((uint32_t)0x00000004U)
#define TMR0_CNTAR_CNTA_3                    ((uint32_t)0x00000008U)
#define TMR0_CNTAR_CNTA_4                    ((uint32_t)0x00000010U)
#define TMR0_CNTAR_CNTA_5                    ((uint32_t)0x00000020U)
#define TMR0_CNTAR_CNTA_6                    ((uint32_t)0x00000040U)
#define TMR0_CNTAR_CNTA_7                    ((uint32_t)0x00000080U)
#define TMR0_CNTAR_CNTA_8                    ((uint32_t)0x00000100U)
#define TMR0_CNTAR_CNTA_9                    ((uint32_t)0x00000200U)
#define TMR0_CNTAR_CNTA_10                   ((uint32_t)0x00000400U)
#define TMR0_CNTAR_CNTA_11                   ((uint32_t)0x00000800U)
#define TMR0_CNTAR_CNTA_12                   ((uint32_t)0x00001000U)
#define TMR0_CNTAR_CNTA_13                   ((uint32_t)0x00002000U)
#define TMR0_CNTAR_CNTA_14                   ((uint32_t)0x00004000U)
#define TMR0_CNTAR_CNTA_15                   ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA_POS                  (0U)
#define TMR0_CMPAR_CMPA                      ((uint32_t)0x0000FFFFU)
#define TMR0_CMPAR_CMPA_0                    ((uint32_t)0x00000001U)
#define TMR0_CMPAR_CMPA_1                    ((uint32_t)0x00000002U)
#define TMR0_CMPAR_CMPA_2                    ((uint32_t)0x00000004U)
#define TMR0_CMPAR_CMPA_3                    ((uint32_t)0x00000008U)
#define TMR0_CMPAR_CMPA_4                    ((uint32_t)0x00000010U)
#define TMR0_CMPAR_CMPA_5                    ((uint32_t)0x00000020U)
#define TMR0_CMPAR_CMPA_6                    ((uint32_t)0x00000040U)
#define TMR0_CMPAR_CMPA_7                    ((uint32_t)0x00000080U)
#define TMR0_CMPAR_CMPA_8                    ((uint32_t)0x00000100U)
#define TMR0_CMPAR_CMPA_9                    ((uint32_t)0x00000200U)
#define TMR0_CMPAR_CMPA_10                   ((uint32_t)0x00000400U)
#define TMR0_CMPAR_CMPA_11                   ((uint32_t)0x00000800U)
#define TMR0_CMPAR_CMPA_12                   ((uint32_t)0x00001000U)
#define TMR0_CMPAR_CMPA_13                   ((uint32_t)0x00002000U)
#define TMR0_CMPAR_CMPA_14                   ((uint32_t)0x00004000U)
#define TMR0_CMPAR_CMPA_15                   ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                  (0U)
#define TMR0_BCONR_CSTA                      ((uint32_t)0x00000001U)
#define TMR0_BCONR_CAPMDA_POS                (1U)
#define TMR0_BCONR_CAPMDA                    ((uint32_t)0x00000002U)
#define TMR0_BCONR_INTENA_POS                (2U)
#define TMR0_BCONR_INTENA                    ((uint32_t)0x00000004U)
#define TMR0_BCONR_CKDIVA_POS                (4U)
#define TMR0_BCONR_CKDIVA                    ((uint32_t)0x000000F0U)
#define TMR0_BCONR_CKDIVA_0                  ((uint32_t)0x00000010U)
#define TMR0_BCONR_CKDIVA_1                  ((uint32_t)0x00000020U)
#define TMR0_BCONR_CKDIVA_2                  ((uint32_t)0x00000040U)
#define TMR0_BCONR_CKDIVA_3                  ((uint32_t)0x00000080U)
#define TMR0_BCONR_SYNSA_POS                 (8U)
#define TMR0_BCONR_SYNSA                     ((uint32_t)0x00000100U)
#define TMR0_BCONR_SYNCLKA_POS               (9U)
#define TMR0_BCONR_SYNCLKA                   ((uint32_t)0x00000200U)
#define TMR0_BCONR_ASYNCLKA_POS              (10U)
#define TMR0_BCONR_ASYNCLKA                  ((uint32_t)0x00000400U)
#define TMR0_BCONR_HSTAA_POS                 (12U)
#define TMR0_BCONR_HSTAA                     ((uint32_t)0x00001000U)
#define TMR0_BCONR_HSTPA_POS                 (13U)
#define TMR0_BCONR_HSTPA                     ((uint32_t)0x00002000U)
#define TMR0_BCONR_HCLEA_POS                 (14U)
#define TMR0_BCONR_HCLEA                     ((uint32_t)0x00004000U)
#define TMR0_BCONR_HICPA_POS                 (15U)
#define TMR0_BCONR_HICPA                     ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA_POS                  (0U)
#define TMR0_STFLR_CMFA                      ((uint32_t)0x00000001U)


