SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral TMR2
*******************************************************************************/
/*  Bit definition for TMR2_CNTAR register  */
#define TMR2_CNTAR_CNTA_POS                  (0U)
#define TMR2_CNTAR_CNTA                      ((uint32_t)0x0000FFFFU)
#define TMR2_CNTAR_CNTA_0                    ((uint32_t)0x00000001U)
#define TMR2_CNTAR_CNTA_1                    ((uint32_t)0x00000002U)
#define TMR2_CNTAR_CNTA_2                    ((uint32_t)0x00000004U)
#define TMR2_CNTAR_CNTA_3                    ((uint32_t)0x00000008U)
#define TMR2_CNTAR_CNTA_4                    ((uint32_t)0x00000010U)
#define TMR2_CNTAR_CNTA_5                    ((uint32_t)0x00000020U)
#define TMR2_CNTAR_CNTA_6                    ((uint32_t)0x00000040U)
#define TMR2_CNTAR_CNTA_7                    ((uint32_t)0x00000080U)
#define TMR2_CNTAR_CNTA_8                    ((uint32_t)0x00000100U)
#define TMR2_CNTAR_CNTA_9                    ((uint32_t)0x00000200U)
#define TMR2_CNTAR_CNTA_10                   ((uint32_t)0x00000400U)
#define TMR2_CNTAR_CNTA_11                   ((uint32_t)0x00000800U)
#define TMR2_CNTAR_CNTA_12                   ((uint32_t)0x00001000U)
#define TMR2_CNTAR_CNTA_13                   ((uint32_t)0x00002000U)
#define TMR2_CNTAR_CNTA_14                   ((uint32_t)0x00004000U)
#define TMR2_CNTAR_CNTA_15                   ((uint32_t)0x00008000U)

/*  Bit definition for TMR2_CMPAR register  */
#define TMR2_CMPAR_CMPA_POS                  (0U)
#define TMR2_CMPAR_CMPA                      ((uint32_t)0x0000FFFFU)
#define TMR2_CMPAR_CMPA_0                    ((uint32_t)0x00000001U)
#define TMR2_CMPAR_CMPA_1                    ((uint32_t)0x00000002U)
#define TMR2_CMPAR_CMPA_2                    ((uint32_t)0x00000004U)
#define TMR2_CMPAR_CMPA_3                    ((uint32_t)0x00000008U)
#define TMR2_CMPAR_CMPA_4                    ((uint32_t)0x00000010U)
#define TMR2_CMPAR_CMPA_5                    ((uint32_t)0x00000020U)
#define TMR2_CMPAR_CMPA_6                    ((uint32_t)0x00000040U)
#define TMR2_CMPAR_CMPA_7                    ((uint32_t)0x00000080U)
#define TMR2_CMPAR_CMPA_8                    ((uint32_t)0x00000100U)
#define TMR2_CMPAR_CMPA_9                    ((uint32_t)0x00000200U)
#define TMR2_CMPAR_CMPA_10                   ((uint32_t)0x00000400U)
#define TMR2_CMPAR_CMPA_11                   ((uint32_t)0x00000800U)
#define TMR2_CMPAR_CMPA_12                   ((uint32_t)0x00001000U)
#define TMR2_CMPAR_CMPA_13                   ((uint32_t)0x00002000U)
#define TMR2_CMPAR_CMPA_14                   ((uint32_t)0x00004000U)
#define TMR2_CMPAR_CMPA_15                   ((uint32_t)0x00008000U)

/*  Bit definition for TMR2_BCONR register  */
#define TMR2_BCONR_CSTA_POS                  (0U)
#define TMR2_BCONR_CSTA                      ((uint32_t)0x00000001U)
#define TMR2_BCONR_CAPMDA_POS                (1U)
#define TMR2_BCONR_CAPMDA                    ((uint32_t)0x00000002U)
#define TMR2_BCONR_SYNSA_POS                 (3U)
#define TMR2_BCONR_SYNSA                     ((uint32_t)0x00000008U)
#define TMR2_BCONR_CKDIVA_POS                (4U)
#define TMR2_BCONR_CKDIVA                    ((uint32_t)0x000000F0U)
#define TMR2_BCONR_CKDIVA_0                  ((uint32_t)0x00000010U)
#define TMR2_BCONR_CKDIVA_1                  ((uint32_t)0x00000020U)
#define TMR2_BCONR_CKDIVA_2                  ((uint32_t)0x00000040U)
#define TMR2_BCONR_CKDIVA_3                  ((uint32_t)0x00000080U)
#define TMR2_BCONR_SYNCLKA_POS               (8U)
#define TMR2_BCONR_SYNCLKA                   ((uint32_t)0x00000300U)
#define TMR2_BCONR_SYNCLKA_0                 ((uint32_t)0x00000100U)
#define TMR2_BCONR_SYNCLKA_1                 ((uint32_t)0x00000200U)
#define TMR2_BCONR_ASYNCLKA_POS              (10U)
#define TMR2_BCONR_ASYNCLKA                  ((uint32_t)0x00000C00U)
#define TMR2_BCONR_ASYNCLKA_0                ((uint32_t)0x00000400U)
#define TMR2_BCONR_ASYNCLKA_1                ((uint32_t)0x00000800U)

/*  Bit definition for TMR2_ICONR register  */
#define TMR2_ICONR_CMENA_POS                 (0U)
#define TMR2_ICONR_CMENA                     ((uint32_t)0x00000001U)
#define TMR2_ICONR_OVENA_POS                 (1U)
#define TMR2_ICONR_OVENA                     ((uint32_t)0x00000002U)

/*  Bit definition for TMR2_PCONR register  */
#define TMR2_PCONR_STACA_POS                 (0U)
#define TMR2_PCONR_STACA                     ((uint32_t)0x00000003U)
#define TMR2_PCONR_STACA_0                   ((uint32_t)0x00000001U)
#define TMR2_PCONR_STACA_1                   ((uint32_t)0x00000002U)
#define TMR2_PCONR_STPCA_POS                 (2U)
#define TMR2_PCONR_STPCA                     ((uint32_t)0x0000000CU)
#define TMR2_PCONR_STPCA_0                   ((uint32_t)0x00000004U)
#define TMR2_PCONR_STPCA_1                   ((uint32_t)0x00000008U)
#define TMR2_PCONR_CMPCA_POS                 (4U)
#define TMR2_PCONR_CMPCA                     ((uint32_t)0x00000030U)
#define TMR2_PCONR_CMPCA_0                   ((uint32_t)0x00000010U)
#define TMR2_PCONR_CMPCA_1                   ((uint32_t)0x00000020U)
#define TMR2_PCONR_OUTENA_POS                (8U)
#define TMR2_PCONR_OUTENA                    ((uint32_t)0x00000100U)
#define TMR2_PCONR_NOFIENA_POS               (12U)
#define TMR2_PCONR_NOFIENA                   ((uint32_t)0x00001000U)
#define TMR2_PCONR_NOFICKA_POS               (13U)
#define TMR2_PCONR_NOFICKA                   ((uint32_t)0x00006000U)
#define TMR2_PCONR_NOFICKA_0                 ((uint32_t)0x00002000U)
#define TMR2_PCONR_NOFICKA_1                 ((uint32_t)0x00004000U)

/*  Bit definition for TMR2_HCONR register  */
#define TMR2_HCONR_HSTA0_POS                 (0U)
#define TMR2_HCONR_HSTA0                     ((uint32_t)0x00000001U)
#define TMR2_HCONR_HSTA1_POS                 (1U)
#define TMR2_HCONR_HSTA1                     ((uint32_t)0x00000002U)
#define TMR2_HCONR_HSTA2_POS                 (2U)
#define TMR2_HCONR_HSTA2                     ((uint32_t)0x00000004U)
#define TMR2_HCONR_HSTP0_POS                 (4U)
#define TMR2_HCONR_HSTP0                     ((uint32_t)0x00000010U)
#define TMR2_HCONR_HSTP1_POS                 (5U)
#define TMR2_HCONR_HSTP1                     ((uint32_t)0x00000020U)
#define TMR2_HCONR_HSTP2_POS                 (6U)
#define TMR2_HCONR_HSTP2                     ((uint32_t)0x00000040U)
#define TMR2_HCONR_HCLE0_POS                 (8U)
#define TMR2_HCONR_HCLE0                     ((uint32_t)0x00000100U)
#define TMR2_HCONR_HCLE1_POS                 (9U)
#define TMR2_HCONR_HCLE1                     ((uint32_t)0x00000200U)
#define TMR2_HCONR_HCLE2_POS                 (10U)
#define TMR2_HCONR_HCLE2                     ((uint32_t)0x00000400U)
#define TMR2_HCONR_HICP0_POS                 (12U)
#define TMR2_HCONR_HICP0                     ((uint32_t)0x00001000U)
#define TMR2_HCONR_HICP1_POS                 (13U)
#define TMR2_HCONR_HICP1                     ((uint32_t)0x00002000U)
#define TMR2_HCONR_HICP2_POS                 (14U)
#define TMR2_HCONR_HICP2                     ((uint32_t)0x00004000U)

/*  Bit definition for TMR2_STFLR register  */
#define TMR2_STFLR_CMFA_POS                  (0U)
#define TMR2_STFLR_CMFA                      ((uint32_t)0x00000001U)
#define TMR2_STFLR_OVFA_POS                  (1U)
#define TMR2_STFLR_OVFA                      ((uint32_t)0x00000002U)


