SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*******************************************************************************
                Bit definition for Peripheral TMR4
*******************************************************************************/
/*  Bit definition for TMR4_OCCRUH register  */
#define TMR4_OCCRUH_OCCRUH                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCCRUL register  */
#define TMR4_OCCRUL_OCCRUL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCCRVH register  */
#define TMR4_OCCRVH_OCCRVH                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCCRVL register  */
#define TMR4_OCCRVL_OCCRVL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCCRWH register  */
#define TMR4_OCCRWH_OCCRWH                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCCRWL register  */
#define TMR4_OCCRWL_OCCRWL                   ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_OCSR register  */
#define TMR4_OCSR_OCEH_POS                   (0U)
#define TMR4_OCSR_OCEH                       ((uint16_t)0x0001U)
#define TMR4_OCSR_OCEL_POS                   (1U)
#define TMR4_OCSR_OCEL                       ((uint16_t)0x0002U)
#define TMR4_OCSR_OCPH_POS                   (2U)
#define TMR4_OCSR_OCPH                       ((uint16_t)0x0004U)
#define TMR4_OCSR_OCPL_POS                   (3U)
#define TMR4_OCSR_OCPL                       ((uint16_t)0x0008U)
#define TMR4_OCSR_OCIEH_POS                  (4U)
#define TMR4_OCSR_OCIEH                      ((uint16_t)0x0010U)
#define TMR4_OCSR_OCIEL_POS                  (5U)
#define TMR4_OCSR_OCIEL                      ((uint16_t)0x0020U)
#define TMR4_OCSR_OCFH_POS                   (6U)
#define TMR4_OCSR_OCFH                       ((uint16_t)0x0040U)
#define TMR4_OCSR_OCFL_POS                   (7U)
#define TMR4_OCSR_OCFL                       ((uint16_t)0x0080U)

/*  Bit definition for TMR4_OCER register  */
#define TMR4_OCER_CHBUFEN_POS                (0U)
#define TMR4_OCER_CHBUFEN                    ((uint16_t)0x0003U)
#define TMR4_OCER_CHBUFEN_0                  ((uint16_t)0x0001U)
#define TMR4_OCER_CHBUFEN_1                  ((uint16_t)0x0002U)
#define TMR4_OCER_CLBUFEN_POS                (2U)
#define TMR4_OCER_CLBUFEN                    ((uint16_t)0x000CU)
#define TMR4_OCER_CLBUFEN_0                  ((uint16_t)0x0004U)
#define TMR4_OCER_CLBUFEN_1                  ((uint16_t)0x0008U)
#define TMR4_OCER_MHBUFEN_POS                (4U)
#define TMR4_OCER_MHBUFEN                    ((uint16_t)0x0030U)
#define TMR4_OCER_MHBUFEN_0                  ((uint16_t)0x0010U)
#define TMR4_OCER_MHBUFEN_1                  ((uint16_t)0x0020U)
#define TMR4_OCER_MLBUFEN_POS                (6U)
#define TMR4_OCER_MLBUFEN                    ((uint16_t)0x00C0U)
#define TMR4_OCER_MLBUFEN_0                  ((uint16_t)0x0040U)
#define TMR4_OCER_MLBUFEN_1                  ((uint16_t)0x0080U)
#define TMR4_OCER_LMCH_POS                   (8U)
#define TMR4_OCER_LMCH                       ((uint16_t)0x0100U)
#define TMR4_OCER_LMCL_POS                   (9U)
#define TMR4_OCER_LMCL                       ((uint16_t)0x0200U)
#define TMR4_OCER_LMMH_POS                   (10U)
#define TMR4_OCER_LMMH                       ((uint16_t)0x0400U)
#define TMR4_OCER_LMML_POS                   (11U)
#define TMR4_OCER_LMML                       ((uint16_t)0x0800U)
#define TMR4_OCER_MCECH_POS                  (12U)
#define TMR4_OCER_MCECH                      ((uint16_t)0x1000U)
#define TMR4_OCER_MCECL_POS                  (13U)
#define TMR4_OCER_MCECL                      ((uint16_t)0x2000U)

/*  Bit definition for TMR4_OCMRH register  */
#define TMR4_OCMRH_OCFDCH_POS                (0U)
#define TMR4_OCMRH_OCFDCH                    ((uint16_t)0x0001U)
#define TMR4_OCMRH_OCFPKH_POS                (1U)
#define TMR4_OCMRH_OCFPKH                    ((uint16_t)0x0002U)
#define TMR4_OCMRH_OCFUCH_POS                (2U)
#define TMR4_OCMRH_OCFUCH                    ((uint16_t)0x0004U)
#define TMR4_OCMRH_OCFZRH_POS                (3U)
#define TMR4_OCMRH_OCFZRH                    ((uint16_t)0x0008U)
#define TMR4_OCMRH_OPDCH_POS                 (4U)
#define TMR4_OCMRH_OPDCH                     ((uint16_t)0x0030U)
#define TMR4_OCMRH_OPDCH_0                   ((uint16_t)0x0010U)
#define TMR4_OCMRH_OPDCH_1                   ((uint16_t)0x0020U)
#define TMR4_OCMRH_OPPKH_POS                 (6U)
#define TMR4_OCMRH_OPPKH                     ((uint16_t)0x00C0U)
#define TMR4_OCMRH_OPPKH_0                   ((uint16_t)0x0040U)
#define TMR4_OCMRH_OPPKH_1                   ((uint16_t)0x0080U)
#define TMR4_OCMRH_OPUCH_POS                 (8U)
#define TMR4_OCMRH_OPUCH                     ((uint16_t)0x0300U)
#define TMR4_OCMRH_OPUCH_0                   ((uint16_t)0x0100U)
#define TMR4_OCMRH_OPUCH_1                   ((uint16_t)0x0200U)
#define TMR4_OCMRH_OPZRH_POS                 (10U)
#define TMR4_OCMRH_OPZRH                     ((uint16_t)0x0C00U)
#define TMR4_OCMRH_OPZRH_0                   ((uint16_t)0x0400U)
#define TMR4_OCMRH_OPZRH_1                   ((uint16_t)0x0800U)
#define TMR4_OCMRH_OPNPKH_POS                (12U)
#define TMR4_OCMRH_OPNPKH                    ((uint16_t)0x3000U)
#define TMR4_OCMRH_OPNPKH_0                  ((uint16_t)0x1000U)
#define TMR4_OCMRH_OPNPKH_1                  ((uint16_t)0x2000U)
#define TMR4_OCMRH_OPNZRH_POS                (14U)
#define TMR4_OCMRH_OPNZRH                    ((uint16_t)0xC000U)
#define TMR4_OCMRH_OPNZRH_0                  ((uint16_t)0x4000U)
#define TMR4_OCMRH_OPNZRH_1                  ((uint16_t)0x8000U)

/*  Bit definition for TMR4_OCMRL register  */
#define TMR4_OCMRL_OCFDCL_POS                (0U)
#define TMR4_OCMRL_OCFDCL                    ((uint32_t)0x00000001U)
#define TMR4_OCMRL_OCFPKL_POS                (1U)
#define TMR4_OCMRL_OCFPKL                    ((uint32_t)0x00000002U)
#define TMR4_OCMRL_OCFUCL_POS                (2U)
#define TMR4_OCMRL_OCFUCL                    ((uint32_t)0x00000004U)
#define TMR4_OCMRL_OCFZRL_POS                (3U)
#define TMR4_OCMRL_OCFZRL                    ((uint32_t)0x00000008U)
#define TMR4_OCMRL_OPDCL_POS                 (4U)
#define TMR4_OCMRL_OPDCL                     ((uint32_t)0x00000030U)
#define TMR4_OCMRL_OPDCL_0                   ((uint32_t)0x00000010U)
#define TMR4_OCMRL_OPDCL_1                   ((uint32_t)0x00000020U)
#define TMR4_OCMRL_OPPKL_POS                 (6U)
#define TMR4_OCMRL_OPPKL                     ((uint32_t)0x000000C0U)
#define TMR4_OCMRL_OPPKL_0                   ((uint32_t)0x00000040U)
#define TMR4_OCMRL_OPPKL_1                   ((uint32_t)0x00000080U)
#define TMR4_OCMRL_OPUCL_POS                 (8U)
#define TMR4_OCMRL_OPUCL                     ((uint32_t)0x00000300U)
#define TMR4_OCMRL_OPUCL_0                   ((uint32_t)0x00000100U)
#define TMR4_OCMRL_OPUCL_1                   ((uint32_t)0x00000200U)
#define TMR4_OCMRL_OPZRL_POS                 (10U)
#define TMR4_OCMRL_OPZRL                     ((uint32_t)0x00000C00U)
#define TMR4_OCMRL_OPZRL_0                   ((uint32_t)0x00000400U)
#define TMR4_OCMRL_OPZRL_1                   ((uint32_t)0x00000800U)
#define TMR4_OCMRL_OPNPKL_POS                (12U)
#define TMR4_OCMRL_OPNPKL                    ((uint32_t)0x00003000U)
#define TMR4_OCMRL_OPNPKL_0                  ((uint32_t)0x00001000U)
#define TMR4_OCMRL_OPNPKL_1                  ((uint32_t)0x00002000U)
#define TMR4_OCMRL_OPNZRL_POS                (14U)
#define TMR4_OCMRL_OPNZRL                    ((uint32_t)0x0000C000U)
#define TMR4_OCMRL_OPNZRL_0                  ((uint32_t)0x00004000U)
#define TMR4_OCMRL_OPNZRL_1                  ((uint32_t)0x00008000U)
#define TMR4_OCMRL_EOPNDCL_POS               (16U)
#define TMR4_OCMRL_EOPNDCL                   ((uint32_t)0x00030000U)
#define TMR4_OCMRL_EOPNDCL_0                 ((uint32_t)0x00010000U)
#define TMR4_OCMRL_EOPNDCL_1                 ((uint32_t)0x00020000U)
#define TMR4_OCMRL_EOPNUCL_POS               (18U)
#define TMR4_OCMRL_EOPNUCL                   ((uint32_t)0x000C0000U)
#define TMR4_OCMRL_EOPNUCL_0                 ((uint32_t)0x00040000U)
#define TMR4_OCMRL_EOPNUCL_1                 ((uint32_t)0x00080000U)
#define TMR4_OCMRL_EOPDCL_POS                (20U)
#define TMR4_OCMRL_EOPDCL                    ((uint32_t)0x00300000U)
#define TMR4_OCMRL_EOPDCL_0                  ((uint32_t)0x00100000U)
#define TMR4_OCMRL_EOPDCL_1                  ((uint32_t)0x00200000U)
#define TMR4_OCMRL_EOPPKL_POS                (22U)
#define TMR4_OCMRL_EOPPKL                    ((uint32_t)0x00C00000U)
#define TMR4_OCMRL_EOPPKL_0                  ((uint32_t)0x00400000U)
#define TMR4_OCMRL_EOPPKL_1                  ((uint32_t)0x00800000U)
#define TMR4_OCMRL_EOPUCL_POS                (24U)
#define TMR4_OCMRL_EOPUCL                    ((uint32_t)0x03000000U)
#define TMR4_OCMRL_EOPUCL_0                  ((uint32_t)0x01000000U)
#define TMR4_OCMRL_EOPUCL_1                  ((uint32_t)0x02000000U)
#define TMR4_OCMRL_EOPZRL_POS                (26U)
#define TMR4_OCMRL_EOPZRL                    ((uint32_t)0x0C000000U)
#define TMR4_OCMRL_EOPZRL_0                  ((uint32_t)0x04000000U)
#define TMR4_OCMRL_EOPZRL_1                  ((uint32_t)0x08000000U)
#define TMR4_OCMRL_EOPNPKL_POS               (28U)
#define TMR4_OCMRL_EOPNPKL                   ((uint32_t)0x30000000U)
#define TMR4_OCMRL_EOPNPKL_0                 ((uint32_t)0x10000000U)
#define TMR4_OCMRL_EOPNPKL_1                 ((uint32_t)0x20000000U)
#define TMR4_OCMRL_EOPNZRL_POS               (30U)
#define TMR4_OCMRL_EOPNZRL                   ((uint32_t)0xC0000000U)
#define TMR4_OCMRL_EOPNZRL_0                 ((uint32_t)0x40000000U)
#define TMR4_OCMRL_EOPNZRL_1                 ((uint32_t)0x80000000U)

/*  Bit definition for TMR4_CPSR register  */
#define TMR4_CPSR_CPSR                       ((uint16_t)0xFFFFU)

