SoCXin/HC32M120/src/template/hc32m120j6tb_template/common/hc32m120j6tb.h
/*  Bit definition for TMRA_BCSTR register  */
#define TMRA_BCSTR_START_POS                 (0U)
#define TMRA_BCSTR_START                     ((uint16_t)0x0001U)
#define TMRA_BCSTR_DIR_POS                   (1U)
#define TMRA_BCSTR_DIR                       ((uint16_t)0x0002U)
#define TMRA_BCSTR_MODE_POS                  (2U)
#define TMRA_BCSTR_MODE                      ((uint16_t)0x0004U)
#define TMRA_BCSTR_CKDIV_POS                 (4U)
#define TMRA_BCSTR_CKDIV                     ((uint16_t)0x00F0U)
#define TMRA_BCSTR_CKDIV_0                   ((uint16_t)0x0010U)
#define TMRA_BCSTR_CKDIV_1                   ((uint16_t)0x0020U)
#define TMRA_BCSTR_CKDIV_2                   ((uint16_t)0x0040U)
#define TMRA_BCSTR_CKDIV_3                   ((uint16_t)0x0080U)
#define TMRA_BCSTR_OVSTP_POS                 (8U)
#define TMRA_BCSTR_OVSTP                     ((uint16_t)0x0100U)
#define TMRA_BCSTR_INENOVF_POS               (12U)
#define TMRA_BCSTR_INENOVF                   ((uint16_t)0x1000U)
#define TMRA_BCSTR_INENUDF_POS               (13U)
#define TMRA_BCSTR_INENUDF                   ((uint16_t)0x2000U)
#define TMRA_BCSTR_OVFF_POS                  (14U)
#define TMRA_BCSTR_OVFF                      ((uint16_t)0x4000U)
#define TMRA_BCSTR_UDFF_POS                  (15U)
#define TMRA_BCSTR_UDFF                      ((uint16_t)0x8000U)

/*  Bit definition for TMRA_HCONR register  */
#define TMRA_HCONR_HSTA0_POS                 (0U)
#define TMRA_HCONR_HSTA0                     ((uint16_t)0x0001U)
#define TMRA_HCONR_HSTA1_POS                 (1U)
#define TMRA_HCONR_HSTA1                     ((uint16_t)0x0002U)
#define TMRA_HCONR_HSTA2_POS                 (2U)
#define TMRA_HCONR_HSTA2                     ((uint16_t)0x0004U)
#define TMRA_HCONR_HSTP0_POS                 (4U)
#define TMRA_HCONR_HSTP0                     ((uint16_t)0x0010U)
#define TMRA_HCONR_HSTP1_POS                 (5U)
#define TMRA_HCONR_HSTP1                     ((uint16_t)0x0020U)
#define TMRA_HCONR_HSTP2_POS                 (6U)
#define TMRA_HCONR_HSTP2                     ((uint16_t)0x0040U)
#define TMRA_HCONR_HCLE0_POS                 (8U)
#define TMRA_HCONR_HCLE0                     ((uint16_t)0x0100U)
#define TMRA_HCONR_HCLE1_POS                 (9U)
#define TMRA_HCONR_HCLE1                     ((uint16_t)0x0200U)
#define TMRA_HCONR_HCLE2_POS                 (10U)
#define TMRA_HCONR_HCLE2                     ((uint16_t)0x0400U)

/*  Bit definition for TMRA_HCUPR register  */
#define TMRA_HCUPR_HCUP0_POS                 (0U)
#define TMRA_HCUPR_HCUP0                     ((uint16_t)0x0001U)
#define TMRA_HCUPR_HCUP1_POS                 (1U)
#define TMRA_HCUPR_HCUP1                     ((uint16_t)0x0002U)
#define TMRA_HCUPR_HCUP2_POS                 (2U)
#define TMRA_HCUPR_HCUP2                     ((uint16_t)0x0004U)
#define TMRA_HCUPR_HCUP3_POS                 (3U)
#define TMRA_HCUPR_HCUP3                     ((uint16_t)0x0008U)
#define TMRA_HCUPR_HCUP4_POS                 (4U)
#define TMRA_HCUPR_HCUP4                     ((uint16_t)0x0010U)
#define TMRA_HCUPR_HCUP5_POS                 (5U)
#define TMRA_HCUPR_HCUP5                     ((uint16_t)0x0020U)
#define TMRA_HCUPR_HCUP6_POS                 (6U)
#define TMRA_HCUPR_HCUP6                     ((uint16_t)0x0040U)
#define TMRA_HCUPR_HCUP7_POS                 (7U)
#define TMRA_HCUPR_HCUP7                     ((uint16_t)0x0080U)
#define TMRA_HCUPR_HCUP8_POS                 (8U)
#define TMRA_HCUPR_HCUP8                     ((uint16_t)0x0100U)
#define TMRA_HCUPR_HCUP9_POS                 (9U)
#define TMRA_HCUPR_HCUP9                     ((uint16_t)0x0200U)
#define TMRA_HCUPR_HCUP10_POS                (10U)
#define TMRA_HCUPR_HCUP10                    ((uint16_t)0x0400U)

/*  Bit definition for TMRA_HCDOR register  */
#define TMRA_HCDOR_HCDO0_POS                 (0U)
#define TMRA_HCDOR_HCDO0                     ((uint16_t)0x0001U)
#define TMRA_HCDOR_HCDO1_POS                 (1U)
#define TMRA_HCDOR_HCDO1                     ((uint16_t)0x0002U)
#define TMRA_HCDOR_HCDO2_POS                 (2U)
#define TMRA_HCDOR_HCDO2                     ((uint16_t)0x0004U)
#define TMRA_HCDOR_HCDO3_POS                 (3U)
#define TMRA_HCDOR_HCDO3                     ((uint16_t)0x0008U)
#define TMRA_HCDOR_HCDO4_POS                 (4U)
#define TMRA_HCDOR_HCDO4                     ((uint16_t)0x0010U)
#define TMRA_HCDOR_HCDO5_POS                 (5U)
#define TMRA_HCDOR_HCDO5                     ((uint16_t)0x0020U)
#define TMRA_HCDOR_HCDO6_POS                 (6U)
#define TMRA_HCDOR_HCDO6                     ((uint16_t)0x0040U)
#define TMRA_HCDOR_HCDO7_POS                 (7U)
#define TMRA_HCDOR_HCDO7                     ((uint16_t)0x0080U)
#define TMRA_HCDOR_HCDO8_POS                 (8U)
#define TMRA_HCDOR_HCDO8                     ((uint16_t)0x0100U)
#define TMRA_HCDOR_HCDO9_POS                 (9U)
#define TMRA_HCDOR_HCDO9                     ((uint16_t)0x0200U)
#define TMRA_HCDOR_HCDO10_POS                (10U)
#define TMRA_HCDOR_HCDO10                    ((uint16_t)0x0400U)

/*  Bit definition for TMRA_ICONR register  */
#define TMRA_ICONR_ITEN1_POS                 (0U)
#define TMRA_ICONR_ITEN1                     ((uint16_t)0x0001U)
#define TMRA_ICONR_ITEN2_POS                 (1U)
#define TMRA_ICONR_ITEN2                     ((uint16_t)0x0002U)

/*  Bit definition for TMRA_ECONR register  */
#define TMRA_ECONR_ETEN1_POS                 (0U)
#define TMRA_ECONR_ETEN1                     ((uint16_t)0x0001U)
#define TMRA_ECONR_ETEN2_POS                 (1U)
#define TMRA_ECONR_ETEN2                     ((uint16_t)0x0002U)

/*  Bit definition for TMRA_FCONR register  */
#define TMRA_FCONR_NOFIENTG_POS              (0U)
#define TMRA_FCONR_NOFIENTG                  ((uint16_t)0x0001U)
#define TMRA_FCONR_NOFICKTG_POS              (1U)
#define TMRA_FCONR_NOFICKTG                  ((uint16_t)0x0006U)
#define TMRA_FCONR_NOFICKTG_0                ((uint16_t)0x0002U)
#define TMRA_FCONR_NOFICKTG_1                ((uint16_t)0x0004U)
#define TMRA_FCONR_NOFIENCA_POS              (8U)
#define TMRA_FCONR_NOFIENCA                  ((uint16_t)0x0100U)
#define TMRA_FCONR_NOFICKCA_POS              (9U)
#define TMRA_FCONR_NOFICKCA                  ((uint16_t)0x0600U)
#define TMRA_FCONR_NOFICKCA_0                ((uint16_t)0x0200U)
#define TMRA_FCONR_NOFICKCA_1                ((uint16_t)0x0400U)
#define TMRA_FCONR_NOFIENCB_POS              (12U)
#define TMRA_FCONR_NOFIENCB                  ((uint16_t)0x1000U)
#define TMRA_FCONR_NOFICKCB_POS              (13U)
#define TMRA_FCONR_NOFICKCB                  ((uint16_t)0x6000U)
#define TMRA_FCONR_NOFICKCB_0                ((uint16_t)0x2000U)
#define TMRA_FCONR_NOFICKCB_1                ((uint16_t)0x4000U)

/*  Bit definition for TMRA_STFLR register  */
#define TMRA_STFLR_CMPF1_POS                 (0U)
#define TMRA_STFLR_CMPF1                     ((uint16_t)0x0001U)
#define TMRA_STFLR_CMPF2_POS                 (1U)
#define TMRA_STFLR_CMPF2                     ((uint16_t)0x0002U)

/*  Bit definition for TMRA_BCONR register  */
#define TMRA_BCONR_BEN_POS                   (0U)
#define TMRA_BCONR_BEN                       ((uint16_t)0x0001U)
#define TMRA_BCONR_BSE0_POS                  (1U)
#define TMRA_BCONR_BSE0                      ((uint16_t)0x0002U)
#define TMRA_BCONR_BSE1_POS                  (2U)
#define TMRA_BCONR_BSE1                      ((uint16_t)0x0004U)

/*  Bit definition for TMRA_CCONR1 register  */
#define TMRA_CCONR1_CAPMD_POS                (0U)
#define TMRA_CCONR1_CAPMD                    ((uint16_t)0x0001U)
#define TMRA_CCONR1_HICP0_POS                (4U)
#define TMRA_CCONR1_HICP0                    ((uint16_t)0x0010U)
#define TMRA_CCONR1_HICP1_POS                (5U)
#define TMRA_CCONR1_HICP1                    ((uint16_t)0x0020U)
#define TMRA_CCONR1_HICP2_POS                (6U)
#define TMRA_CCONR1_HICP2                    ((uint16_t)0x0040U)
#define TMRA_CCONR1_NOFIENCP_POS             (12U)
#define TMRA_CCONR1_NOFIENCP                 ((uint16_t)0x1000U)
#define TMRA_CCONR1_NOFICKCP_POS             (13U)
#define TMRA_CCONR1_NOFICKCP                 ((uint16_t)0x6000U)
#define TMRA_CCONR1_NOFICKCP_0               ((uint16_t)0x2000U)
#define TMRA_CCONR1_NOFICKCP_1               ((uint16_t)0x4000U)

/*  Bit definition for TMRA_CCONR2 register  */
#define TMRA_CCONR2_CAPMD_POS                (0U)
#define TMRA_CCONR2_CAPMD                    ((uint16_t)0x0001U)
#define TMRA_CCONR2_HICP0_POS                (4U)
#define TMRA_CCONR2_HICP0                    ((uint16_t)0x0010U)
#define TMRA_CCONR2_HICP1_POS                (5U)
#define TMRA_CCONR2_HICP1                    ((uint16_t)0x0020U)
#define TMRA_CCONR2_HICP2_POS                (6U)
#define TMRA_CCONR2_HICP2                    ((uint16_t)0x0040U)
#define TMRA_CCONR2_NOFIENCP_POS             (12U)
#define TMRA_CCONR2_NOFIENCP                 ((uint16_t)0x1000U)
#define TMRA_CCONR2_NOFICKCP_POS             (13U)
#define TMRA_CCONR2_NOFICKCP                 ((uint16_t)0x6000U)
#define TMRA_CCONR2_NOFICKCP_0               ((uint16_t)0x2000U)
#define TMRA_CCONR2_NOFICKCP_1               ((uint16_t)0x4000U)

/*  Bit definition for TMRA_PCONR1 register  */
#define TMRA_PCONR1_STAC_POS                 (0U)
#define TMRA_PCONR1_STAC                     ((uint16_t)0x0003U)
#define TMRA_PCONR1_STAC_0                   ((uint16_t)0x0001U)
#define TMRA_PCONR1_STAC_1                   ((uint16_t)0x0002U)
#define TMRA_PCONR1_STPC_POS                 (2U)
#define TMRA_PCONR1_STPC                     ((uint16_t)0x000CU)
#define TMRA_PCONR1_STPC_0                   ((uint16_t)0x0004U)
#define TMRA_PCONR1_STPC_1                   ((uint16_t)0x0008U)
#define TMRA_PCONR1_CMPC_POS                 (4U)
#define TMRA_PCONR1_CMPC                     ((uint16_t)0x0030U)
#define TMRA_PCONR1_CMPC_0                   ((uint16_t)0x0010U)
#define TMRA_PCONR1_CMPC_1                   ((uint16_t)0x0020U)
#define TMRA_PCONR1_PERC_POS                 (6U)
#define TMRA_PCONR1_PERC                     ((uint16_t)0x00C0U)
#define TMRA_PCONR1_PERC_0                   ((uint16_t)0x0040U)
#define TMRA_PCONR1_PERC_1                   ((uint16_t)0x0080U)
#define TMRA_PCONR1_FORC_POS                 (8U)
#define TMRA_PCONR1_FORC                     ((uint16_t)0x0300U)
#define TMRA_PCONR1_FORC_0                   ((uint16_t)0x0100U)
#define TMRA_PCONR1_FORC_1                   ((uint16_t)0x0200U)
#define TMRA_PCONR1_OUTEN_POS                (12U)
#define TMRA_PCONR1_OUTEN                    ((uint16_t)0x1000U)

/*  Bit definition for TMRA_PCONR2 register  */
#define TMRA_PCONR2_STAC_POS                 (0U)
#define TMRA_PCONR2_STAC                     ((uint16_t)0x0003U)
#define TMRA_PCONR2_STAC_0                   ((uint16_t)0x0001U)
#define TMRA_PCONR2_STAC_1                   ((uint16_t)0x0002U)
#define TMRA_PCONR2_STPC_POS                 (2U)
#define TMRA_PCONR2_STPC                     ((uint16_t)0x000CU)
#define TMRA_PCONR2_STPC_0                   ((uint16_t)0x0004U)
#define TMRA_PCONR2_STPC_1                   ((uint16_t)0x0008U)
#define TMRA_PCONR2_CMPC_POS                 (4U)
#define TMRA_PCONR2_CMPC                     ((uint16_t)0x0030U)
#define TMRA_PCONR2_CMPC_0                   ((uint16_t)0x0010U)
#define TMRA_PCONR2_CMPC_1                   ((uint16_t)0x0020U)
#define TMRA_PCONR2_PERC_POS                 (6U)
#define TMRA_PCONR2_PERC                     ((uint16_t)0x00C0U)
#define TMRA_PCONR2_PERC_0                   ((uint16_t)0x0040U)
#define TMRA_PCONR2_PERC_1                   ((uint16_t)0x0080U)
#define TMRA_PCONR2_FORC_POS                 (8U)
#define TMRA_PCONR2_FORC                     ((uint16_t)0x0300U)
#define TMRA_PCONR2_FORC_0                   ((uint16_t)0x0100U)
#define TMRA_PCONR2_FORC_1                   ((uint16_t)0x0200U)
#define TMRA_PCONR2_OUTEN_POS                (12U)
#define TMRA_PCONR2_OUTEN                    ((uint16_t)0x1000U)


